config.org
# -*- eval: (load-file "./ceamx-dev-loader.el") -*-
:PROPERTIES:
:ID:       3101f339-2824-4a4c-baa2-7f83a2d3555d
:END:
#+title: Ceamx: An Emacs Configuration
#+author: Chris Montgomery
#+email: chmont@protonmail.com
#+language: en
#+property: header-args:emacs-lisp+ :results silent :comments org
#+property: header-args:shell+      :results replace
#+property: header-args             :mkdirp yes :tangle no :exports code :noweb yes

This is a user configuration for GNU Emacs.

The target operating system is GNU/Linux, though the configuration
will usually also work on macOS.

* Agenda [0/0]
:PROPERTIES:
:VISIBILITY: folded
:ID:       812b1bf4-a323-427d-b3cd-44f916d6f437
:END:
* Bootstrap
:PROPERTIES:
:VISIBILITY: folded
:END:
** =early-init.el=
:PROPERTIES:
:header-args: :tangle early-init.el :comments both
:VISIBILITY: folded
:END:

*** File Header

#+begin_src emacs-lisp :tangle early-init.el :startup folded :comments no
;;; early-init.el --- Early initialization file  -*- lexical-binding: t; no-byte-compile: t; -*-

;; Copyright (c) 2022-2025  Chris Montgomery <chmont@protonmail.com>

;; Author: Chris Montgomery <chmont@protonmail.com>

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

;;; Commentary:
;;; Code:
#+end_src

*** Prevent package.el from enabling all packages before init

- [[https://old.reddit.com/r/emacs/comments/np6ey4/how_packageel_works_with_use_package/][How package.el Works with Use Package : emacs]]


When nil and using the builtin package manager, ~package-initialize~ must be
invoked in the init process prior to ~require~ing any packages installed with
~package-install~.

When non-nil, there is no need to invoke ~package-initialize~.

#+begin_src emacs-lisp
(setq package-enable-at-startup nil)
#+end_src

*** Define proxy hooks for ~after-init-hook~ and ~emacs-startup-hook~

#+begin_src emacs-lisp
(defvar ceamx-after-init-hook '())
(defun ceamx-after-init-hook ()
  (run-hooks 'ceamx-after-init-hook))

(defvar ceamx-emacs-startup-hook '())
(defun ceamx-emacs-startup-hook ()
  (run-hooks 'ceamx-emacs-startup-hook))
#+end_src

*** Performance
**** Minimize garbage collection during startup

[[https://old.reddit.com/r/emacs/comments/yzb77m/an_easy_trick_i_found_to_improve_emacs_startup/iwz1vek/][eli-zaretskii comments on An easy trick I found to improve Emacs start-up time]]:

#+begin_quote
My advice is to spend some time measuring the effect of increased GC threshold
on operations that you care about and that take a long enough time to annoy,
and use the lowest threshold value which produces a tangible improvement.
Start with the default value, then enlarge it by a factor of 2 until you see
only insignificant speedups. I would not expect the value you arrive at to be
as high as 100 MiB.
#+end_quote

See also:

<https://github.com/jwiegley/dot-emacs/blob/master/init.org#startup>

**** Provide insight into garbage-collection activity to inform tuning decisions

#+begin_src emacs-lisp
;; TODO: will a `init-file-debug' check work here?
(setq garbage-collection-messages t)
#+end_src

**** Prevent garbage-collection during init

#+begin_src emacs-lisp
;; NOTE: Either use `gcmh' or make sure to reset this later.  Or else!
(setq gc-cons-threshold (* 128 1024 1024)) ; 128MiB
#+end_src

**** DISABLED Simplify filename pattern-matching during init

- Note taken on [2024-11-19 Tue 20:52] \\
  This was not properly excluded from tangling until restructuring my config
  today!  So it has actually been present in =early-init.el= for some time...
- Note taken on [2024-03-23 Sat 03:24] \\
  Quick followup: I would not be surprised if this had something to do with adding
  ~ceamx-restore-file-name-handler-alist-h~ on ~ceamx-after-init-hook~, which is
  equivalent to ~elpaca-after-init-hook~.
- Note taken on [2024-03-23 Sat 03:01] \\
  This snippet appears to cause Emacs to lose track of its own source files in most sessions.

  ~describe-function~ and ~helpful-function~ report symbols "without a source
  file".  I did not have much to go on until I became aware of ~find-function~.
  After invoking the latter on a function whose source could not be located, I
  noticed a clue: ~find-function~ somehow knew about the source file with a =.el=
  extension.  I investigated the Emacs =lisp/= directory and saw that there are no
  =.el= files -- only =.elc= and =.el.gz=.  The =.elc= files are unreadable, but
  Emacs is still able to read the compressed =gz= archives.  I still do not know
  exactly why it forgot.

  The issue has not been consistent, which likely indicates a race condition.  For
  a while, I assumed the issue occurred in consecutive sessions after calling
  ~restart-emacs~, but that was not the case.

  Disabling this hack is the only consistent way I found to help Emacs find
  itself.  Re-enabling it caused the issue to recur.  In the end, after
  disabling, I see absolutely no difference in startup performance.
  Optimization-by-copypasta strikes again.

  This has been a very frustrating regression in many/most of my Emacs sessions.
  I rely a lot on being able to read Emacs Lisp source code to understand how
  Emacs works -- that is how I learn.  Without being able to view source, I am
  left only with a lack of clarity.

- <https://github.com/jwiegley/dot-emacs/blob/79bc2cff3a28ecd1a315609bbb607eb4ba700f76/init.org#during-loading-of-this-module-clear-file-name-handler-alist>
- <https://old.reddit.com/r/emacs/comments/3kqt6e/2_easy_little_known_steps_to_speed_up_emacs_start/>

#+begin_src emacs-lisp :tangle no
(defvar ceamx-file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

(defun ceamx-restore-file-name-handler-alist-h ()
  "Restore the original value of the `file-name-handler-alist' variable.
Intended for use as a callback on `ceamx-after-init-hook'."
  (setq file-name-handler-alist ceamx-file-name-handler-alist)
  (makunbound 'ceamx-file-name-handler-alist))

(add-hook 'ceamx-after-init-hook #'ceamx-restore-file-name-handler-alist-h)
#+end_src

*** Directories and well-known-files
:PROPERTIES:
:ID:       c7734cbe-7b46-40d6-bab4-3003417ac852
:END:

Add the top-level directories to the load path:

#+begin_src emacs-lisp
(dolist (subdir '("autoloads" "lisp" "site-lisp"))
  (let ((dir (expand-file-name subdir user-emacs-directory)))
    (add-to-list 'load-path dir)))
#+end_src

Load the essential core libraries:

#+begin_src emacs-lisp
(require 'ceamx-paths)
(require 'ceamx-lib)
#+end_src

Add all =site-lisp= subdirectories to load-path:

#+begin_src emacs-lisp
(prependq! load-path (ceamx-subdirs ceamx-site-lisp-dir))
#+end_src

Store packages in the designated directory:

#+begin_src emacs-lisp
(setq package-user-dir ceamx-packages-dir)
#+end_src

*** Native compilation settings

#+begin_src emacs-lisp
;; Use preferred cache directories for native compilation.
(startup-redirect-eln-cache ceamx-eln-dir)
(add-to-list 'native-comp-eln-load-path ceamx-eln-dir)

(setq native-comp-async-report-warnings-errors 'silent)
(setq native-compile-prune-cache t)

;; Don't load outdated byte-compiled files.
;;
;; NOTE: This does not handle *recompiling* the outdated files.
;; That would need to be handled during init.
;;
;; More info: <https://github.com/emacscollective/auto-compile/blob/main/README.org>
(setq load-prefer-newer t)

;; Package installation will provoke a lot of warnings from third-party
;; packages, but there's nothing we can do about those.
(setq byte-compile-warnings nil)
#+end_src

*** Disable the bell

#+begin_src emacs-lisp
(setq ring-bell-function #'ignore)
#+end_src

*** Appearance: integrate with desktop environment

#+begin_src emacs-lisp
;; Prevent X11 from taking control of visual behavior and appearance.
(setq inhibit-x-resources t)
#+end_src

*** FIXME these should be renamed or moved as their namespace indicates
:PROPERTIES:
:ID:       1c6484de-65ca-4533-a6bb-baa9e01f5f0a
:END:
they would normally live in the ~ceamx-ui~ feature.

#+begin_src emacs-lisp
(defconst ceamx-ui-gsettings-ui-namespace "org.gnome.desktop.interface")

(defvar ceamx-ui-tiling-window-manager-regexp "sway"
  "Regular expression matching supported tiling window managers.")

(defmacro with-desktop-session! (&rest body)
  "Expand BODY if desktop session is not a tiling window manager.
See `ceamx-ui-tiling-window-manager-regexp' for the definition of
supported tiling window managers."
  (declare (indent 0))
  `(when-let* ((session (getenv "DESKTOP_SESSION"))
               (not (string-match-p session ceamx-ui-tiling-window-manager-regexp)))
     ,@body))

(defun ceamx-ui-gsettings-theme ()
  "Get the currently-active GNOME/GTK color scheme."
  (shell-command-to-string (format "gsettings get %s color-scheme"
                                   ceamx-ui-gsettings-ui-namespace)))

(defun ceamx-ui-gsettings-dark-theme-p ()
  "Whether GNOME/GTK are using a theme with a dark color scheme."
  (string-match-p "dark" (ceamx-ui-gsettings-theme)))

(defun ceamx-ui-desktop-dark-theme-p ()
  "Predicate whether a desktop environment is displaying a dark appearance."
  (or (ceamx-ui-gsettings-dark-theme-p)))

(defun ceamx-ui-re-enable-frame-theme (_frame)
  "Re-enable active theme, if any, upon FRAME creation.
Add this to `after-make-frame-functions' so that new frames do
not retain the generic background set by the function
`ceamx-init-prevent-initial-light-flash'."
  (when-let* ((theme (car custom-enabled-themes)))
    (enable-theme theme)))
#+end_src

*** Appearance: basic frame settings
:PROPERTIES:
:ID:       5cb09a22-f6b2-418d-bf82-24ff743b1cf9
:END:

#+begin_src emacs-lisp
(setq frame-resize-pixelwise t
      frame-inhibit-implied-resize t
      frame-title-format '("%b")
      use-dialog-box t
      use-file-dialog nil
      use-short-answers t              ; affects `yes-or-no-p'
      read-answer-short t              ; affects `read-answer' (completion)
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-startup-echo-area-message user-login-name
      inhibit-startup-buffer-menu t)

(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)

;; `tooltip-mode' is broken for me in pgtk -- might be an Emacs bug,
;; causes constant errors when moving mouse over modeline.
;;
;; FIXME: actually, this is behaving inconsistently: disabling it does
;; not necessarily work, and toggling it off/on allows `tooltip-mode'
;; to function normally...  maybe needs to happen later in init?
(tooltip-mode -1)
#+end_src

*** Appearance: default frame parameters
:PROPERTIES:
:ID:       712b6440-d9e3-48ac-ab2a-9211ed351602
:END:

#+begin_src emacs-lisp
(with-desktop-session!
  (mapc
   (lambda (var)
     (add-to-list var '(width . (text-pixels . 800)))
     (add-to-list var '(height . (text-pixels . 900)))
     (add-to-list var '(scroll-bar-width . 10))     )
   '(default-frame-alist initial-frame-alist)))
#+end_src

*** Appearance: avoid flash of light in a dark environment
:PROPERTIES:
:ID:       dd8efe90-3f35-48c6-ba11-056060ec47cd
:END:

- source :: <https://protesilaos.com/emacs/dotemacs#h:7d3a283e-1595-4692-8124-e0d683cb15b2>


#+begin_src emacs-lisp
(defun ceamx-init-prevent-initial-light-flash ()
  "Avoid the bright flash of light during startup in dark environments."
  (when (ceamx-ui-desktop-dark-theme-p)
    (set-face-attribute 'default nil
                        :background "#000000"
                        :foreground "#ffffff")
    (set-face-attribute 'mode-line nil
                        :background "#000000"
                        :foreground "#ffffff"
                        :box 'unspecified)
    (add-hook 'after-make-frame-functions #'ceamx-ui-re-enable-frame-theme)))

(ceamx-init-prevent-initial-light-flash)
#+end_src

*** Rename the default/initial frame

#+begin_src emacs-lisp
(defvar ceamx-default-frame-name "home"
  "Name for the default Emacs frame.")

(defun ceamx-after-init-default-frame-name-h ()
  "Set the name for the default frame.
Simple wrapper for a call to `set-frame-name' providing
`ceamx-default-frame-name' as the NAME argument.

Intended for use as a callback on the `ceamx-after-init-hook'."
  (set-frame-name ceamx-default-frame-name))

(add-hook 'ceamx-after-init-hook #'ceamx-after-init-default-frame-name-h)
#+end_src

** =init.el=
:PROPERTIES:
:header-args: :tangle init.el :comments both
:END:

*** File header

#+begin_src emacs-lisp :tangle init.el :comments no
;;; init.el --- Ceamx -*- lexical-binding: t; no-byte-compile: t; -*-

;; Copyright (c) 2022-2025  Chris Montgomery <chmont@protonmail.com>

;; Author: Chris Montgomery <chmont@protonmail.com>

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.


;;; Commentary:
;;; Code:
#+end_src

*** Requirements

#+begin_src emacs-lisp
(require 'cl-lib)

(require 'ceamx-paths)
(require 'ceamx-lib)
#+end_src

*** Configure default identity

#+begin_src emacs-lisp
(setq-default user-full-name "Chris Montgomery"
              user-mail-address "chmont@protonmail.com")
#+end_src

*** Profiling

- source :: <https://github.com/progfolio/.emacs.d/blob/ed159dc6076664ad9976949d8cb3af8e86fe39d1/init.org#profiling>

#+begin_src emacs-lisp :lexical t
(add-hook 'ceamx-after-init-hook
          (lambda ()
            (message "Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract (current-time) before-init-time)))
                     gcs-done)))
#+end_src

Optionally, display a report after startup:

#+begin_src emacs-lisp :lexical t :tangle no
(profiler-start 'cpu+mem)
(add-hook 'ceamx-after-init-hook (lambda () (profiler-stop) (profiler-report)))
#+end_src

ELP is useful for seeing which functions in a package are "hot":

#+begin_src emacs-lisp :var file="elpaca" :lexical t :tangle no
(require 'elp)
(with-eval-after-load file
  (elp-instrument-package file))
(add-hook ceamx-after-init-hook
          (lambda () (elp-results) (elp-restore-package (intern file))))
#+end_src

*** Initialize the =ceamx= user options

#+begin_src emacs-lisp
(defgroup ceamx nil
  "User-configurable options for Ceamx."
  :group 'emacs)
#+end_src

**** The user option to define directory trees whose files should be opened in read-only buffers :config:

#+begin_src emacs-lisp
(defcustom ceamx-buffer-read-only-dirs-list (list ceamx-packages-dir)
  "List of directories whose files should be opened in read-only buffers."
  :group 'ceamx
  :type '(string))
#+end_src

**** The user option to determine whether to load ~custom-file~

#+begin_src emacs-lisp
(defcustom ceamx-load-custom-file t
  "Whether to load the user `custom-file' (custom.el)."
  :group 'ceamx
  :type '(boolean))
#+end_src

