config.org
**** Elpaca-Wait № 1: ~no-littering~ + ~use-package~ :wait:

Reason:

- Continuing otherwise will result in race conditions on the
  definition of storage paths.
- ~use-package~ must be loaded for byte-compilation checks

#+begin_src emacs-lisp
(elpaca-wait)
#+end_src

**** Configure ~use-package~ behavior

#+begin_src emacs-lisp
(setopt use-package-always-ensure t)
(setopt use-package-expand-minimally t)

(when (bound-and-true-p init-file-debug)
  (require 'use-package)
  (setopt use-package-expand-minimally nil)
  (setopt use-package-verbose t)
  (setopt use-package-compute-statistics t))
#+end_src

**** Improve ~use-package~ completion-at-point availability
:PROPERTIES:
:ID:       863979e9-5559-4abf-903e-307f528e6263
:END:

#+begin_src emacs-lisp
(def-advice! ceamx+use-package--bind-handle-sharp-quotes-a (args)
  :filter-args #'use-package-normalize-binder
  "Make `use-package' handle sharp-quoted functions correctly in `:bind'.
Performs a recursive find-and-replace on sharp quotes in the arguments,
because that's the simple solution and the performance overhead is
unimportant since it happens during compilation anyway."
  (ceamx--remove-sharp-quotes args))
#+end_src

**** =blackout=: adjust mode-line lighters :modeline:

- Use-Package keyword :: =:blackout=

#+begin_src emacs-lisp
(use-package blackout
  :ensure (:wait t)
  :demand t)
#+end_src

**** Install and configure =setup.el=

#+begin_src emacs-lisp
(elpaca setup
  (require 'setup))

(elpaca-wait)
#+end_src

Add Elpaca support to =setup.el=:

#+begin_src emacs-lisp
(defun +setup-wrap-to-install-elpaca-package (body _name)
  "Wrap BODY in an `elpaca' block when `:ensure' is provided."
  (if (assq 'ensure setup-attributes)
      `(elpaca ,(cdr (assq 'ensure setup-attributes))
         ,@(macroexp-unprogn body))
    body))

(add-to-list 'setup-modifier-list #'+setup-wrap-to-install-elpaca-package)

(setup-define :ensure
  (lambda (order &rest recipe)
    (push (cond
           ((eq order t) `(ensure . ,(setup-get 'feature)))
           ((eq order nil) `(ensure . nil))
           (`(ensure . (,order ,@recipe))))
          setup-attributes)
    ;; If the macro returned non-nil, it would try to insert the
    ;; modified list returned by `push'.  As this value usually cannot
    ;; be evaluated, it is better to return nil (which the byte
    ;; compiler will optimize away).
    nil)
  :documentation "Install ORDER with the `elpaca' package manager.
The ORDER can be used to deduce the feature context."
  :shorthand #'cadr)
#+end_src

Add the =:autoload= contextual macro:

#+begin_src emacs-lisp
;; <https://www.emacswiki.org/emacs/SetupEl#h5o-7>
(setup-define :autoload
  (lambda (func)
    (let ((fn (if (memq (car-safe func) '(quote function))
                  (cadr func)
                func)))
      `(unless (fboundp (quote ,fn))
         (autoload (function ,fn) ,(symbol-name (setup-get 'feature)) nil t))))
  :documentation "Autoload COMMAND if not already bound."
  :debug '(form)
  :repeatable t
  :signature '(FUNC ...))
#+end_src

Add the =:load-after= contextual macro:

#+begin_src emacs-lisp
(setup-define :load-after
    (lambda (&rest features)
      (let ((body `(require ',(setup-get 'feature))))
        (dolist (feature (nreverse features))
          (setq body `(with-eval-after-load ',feature ,body)))
        body))
    :documentation "Load the current feature after FEATURES.")
#+end_src

*** =gcmh=: manage running garbage collection on idle :package:perf:

- Website :: <https://akrl.sdf.org/>
- Code :: <https://gitlab.com/koral/gcmh>

During normal use, the GC threshold will be set to a high value.
When idle, GC will be triggered with a low threshold.

#+begin_src emacs-lisp
(package! gcmh
  (blackout 'gcmh-mode)
  (add-hook 'ceamx-emacs-startup-hook #'gcmh-mode))
#+end_src

**** Background and Rationale

While browsing many other user configs, I have noticed several slightly
different approaches to managing garbage collection, especially with the
intent of reducing startup time.

One approach is to offload this configuration to ~gcmh~, safely hiding the
details away.  =gcmh= is written by Andrea Corallo, one of the Emacs
co-maintainers, also known for introducing =gccemacs=.

As a direct response to a Reddit thread sharing =gcmh=, Eli Zaretskii recommends
caution in this field.  Corallo also weighs in.  Basically, Zaretskii recommends
not overthinking things:

[[https://old.reddit.com/r/emacs/comments/bg85qm/garbage_collector_magic_hack/eln27qh/][eli-zaretskii
comments on Garbage Collector Magic Hack]]:

#+begin_quote
My problem with the advice to make the GC threshold at such high values
begins the moment you start publishing your personal tweaks as general
advice to others. IMO, this requires at least a lot of caveats, because
your advice is likely to be followed by people whose workflows and
system configurations are very different. Simply put, you might get
others in trouble by promoting your personal hacks as "magic".
#+end_quote

From what I gather, =gcmh= has evolved a bit, so the previous criticism
no longer applies.

And, again, with more detail about fiddling carelessly with
=gc-cons-threshold=:

[[https://old.reddit.com/r/emacs/comments/yzb77m/an_easy_trick_i_found_to_improve_emacs_startup/iwz1vek/][eli-zaretskii
comments on An easy trick I found to improve Emacs start-up time]]

#+begin_quote
The GC threshold setting after init is too high, IMNSHO, and its value
seems arbitrary.

If the OP thinks that Emacs will GC as soon as it allocates 100 MiB,
then that's a grave mistake. What really happens is the first time Emacs
/considers doing GC/, if at that time more than 100 MiB have been
allocated for Lisp objects, Emacs will GC. And since neither Lisp
programs nor the user have /any/ control on how soon Emacs will decide
to check whether GC is needed, the actual amount of memory by the time
Emacs checks could be many times the value of the threshold.

My advice is to spend some time measuring the effect of increased GC
threshold on operations that you care about and that take a long enough
time to annoy, and use the lowest threshold value which produces a
tangible improvement. Start with the default value, then enlarge it by a
factor of 2 until you see only insignificant speedups. I would not
expect the value you arrive at to be as high as 100 MiB.
#+end_quote

*** Install utility libraries
:PROPERTIES:
:ID:       d04ef910-34e0-4961-aeb6-c2741af41455
:END:

#+begin_src emacs-lisp
(package! llama
  (require 'llama))
(package! f)
(package! request)
(package! transient
  (require 'transient)
  (after! transient
    (keymap-set transient-map "<escape>" #'transient-quit-one)))
#+end_src

** =init.el=: Environment
:PROPERTIES:
:header-args: :tangle init.el
:ID:       451ef1a7-544c-45de-95d0-ca09abee5d23
:END:

*** Disable unnecessary OS-specific command-line options :macos:

#+begin_src emacs-lisp
(unless (ceamx-host-macos-p)
  (setq command-line-ns-option-alist nil))

(unless (ceamx-host-gnu-linux-p)
  (setq command-line-x-option-alist nil))
#+end_src

*** =exec-path-from-shell=: Inherit environment variables from variable environments :package:

#+begin_src emacs-lisp
(package! exec-path-from-shell
  (require 'exec-path-from-shell)
  (dolist (var '("SSH_AUTH_SOCK" "SSH_AGENT_PID" "GPG_AGENT_INFO" "LANG" "LC_CTYPE" "NIX_SSL_CERT_FILE" "NIX_PATH" "LSP_USE_PLISTS"))
    (add-to-list 'exec-path-from-shell-variables var))
  (exec-path-from-shell-initialize))
#+end_src

*** =inheritenv=: Make temporary buffers inherit buffer-local environment variables :package:

- website :: <https://github.com/purcell/inheritenv>

#+begin_src emacs-lisp
(package! inheritenv
  (with-eval-after-load 'exec-path-from-shell
    (require 'inheritenv)))
#+end_src

*** =with-editor=: Ensure shell/term modes use session as =$EDITOR= :package:

#+begin_src emacs-lisp
(package! with-editor
  (keymap-global-set "<remap> <async-shell-command>"
                     #'with-editor-async-shell-command)
  (keymap-global-set "<remap> <shell-command>"
                     #'with-editor-shell-command)

  (add-hook 'shell-mode-hook #'with-editor-export-editor)
  (add-hook 'eshell-mode-hook #'with-editor-export-editor)
  (add-hook 'term-exec-hook #'with-editor-export-editor)

  ;; Make sure that `eat' does not break `magit-commit'.
  ;; <https://codeberg.org/akib/emacs-eat/issues/55#issuecomment-871388>
  (with-eval-after-load 'eat
    (add-hook 'eat-mode-hook #'shell-command-with-editor-mode)))
#+end_src

*** =envrc= :: Direnv integration :package:
:PROPERTIES:
:ID:       4572e438-3d90-4ed3-88af-a7c2493a2e19
:END:

- src :: <https://github.com/purcell/envrc>
- upstream :: <https://github.com/direnv/direnv>

Q: How does this differ from `direnv.el`?

<https://github.com/wbolster/emacs-direnv> repeatedly changes the global
Emacs environment, based on tracking what buffer you're working on.

Instead, `envrc.el` simply sets and stores the right environment in each
buffer, as a buffer-local variable.

#+begin_src emacs-lisp
(package! envrc
  (after! exec-path-from-shell
    (envrc-global-mode))
  (after! popper
    (add-to-list 'popper-reference-buffers "\\*envrc\\*")))
#+end_src

*** Elpaca-Wait № 3 :wait:

#+begin_src emacs-lisp
(elpaca-wait)
#+end_src

*** TRAMP Support

#+begin_src emacs-lisp
(setopt tramp-default-method "ssh")
(setopt tramp-default-remote-shell "/bin/bash")
(setopt tramp-connection-timeout (* 60 10))
;; Do not auto-save remote files. Note the reversed logic.
(setopt remote-file-name-inhibit-auto-save t)                 ; Emacs 30
(setopt remote-file-name-inhibit-auto-save-visited t)
;; Avoid expensive operations on remote files.
(setopt remote-file-name-inhibit-delete-by-moving-to-trash t) ; Emacs 30

(after! tramp
  (dolist (path '("~/.local/bin"
                  "~/.nix-profile/bin"
                  "~/.local/state/nix/profiles/profile/bin/"
                  "/nix/var/nix/profiles/default/bin"
                  "/run/current-system/sw/bin"))
    (add-to-list 'tramp-remote-path path)))
#+end_src

*** Input languages

#+begin_src emacs-lisp
(set-language-environment "UTF-8")

;; `set-language-environment' also presumptively sets `default-input-method'.
(setopt default-input-method nil)
#+end_src

#+begin_src emacs-lisp
;; Disable bidirectional text scanning
;; (setq-default bidi-display-reordering 'left-to-right)
;; (setq-default bidi-paragraph-direction 'left-to-right)
;; (setq bidi-inhibit-bpa t)
#+end_src

*** Mouse support

#+begin_src emacs-lisp
(setopt mouse-yank-at-point t)

;; Avoid collision of mouse with point
(mouse-avoidance-mode 'exile)
#+end_src

Support scrolling with the mouse wheel or trackpad gestures within
non-graphical frames.  Mouse support is available by default in
graphical frames.

#+begin_src emacs-lisp
(unless (display-graphic-p)

  ;; Basic mouse support e.g. click and drag
  (xterm-mouse-mode 1)

  ;; By default, `scroll-down' and `scroll-up' scroll by a huge amount.
  (eval-and-compile
    (defun ceamx/scroll-down ()
      "Scroll down one line."
      (interactive)
      (scroll-down 1))

    (defun ceamx/scroll-up ()
      "Scroll up one line."
      (interactive)
      (scroll-up 1)))

  (global-set-key [mouse-4] #'ceamx/scroll-down)
  (global-set-key [mouse-5] #'ceamx/scroll-up))
#+end_src

*** Load site-specific configuration, to be ignored by version control

#+begin_src emacs-lisp
(require 'site-config (file-name-concat user-emacs-directory "site-config") t)
#+end_src

** =init.el= :: Leader Prefix Keybindings
:PROPERTIES:
:header-args: :tangle init.el
:ID:       cd713eda-629c-460c-921e-d99ce8f6742f
:END:

#+begin_src emacs-lisp
(define-keymap :keymap (current-global-map)
  "C-c a" nil ; reserved for agenda
  "C-c b" (cons "[ BUFFER    ]" #'ceamx-buffer-prefix)
  "C-c c" nil ; reserved for capture
  "C-c C" (cons "[ CAPTURE   ]" #'ceamx-capture-prefix)
  ;; "C-c d"
  "C-c e" (cons "[ EDIT      ]" #'ceamx-structural-editing-prefix)
  "C-c E" (cons "[ CRYPTION  ]" #'ceamx-cryption-prefix)
  "C-c f" (cons "[ FILE      ]" #'ceamx-file-prefix)
  "C-c i" (cons "[ INSERT    ]" #'ceamx-insert-prefix)
  ;; "C-c j"
  "C-c l" (cons "[ CODE      ]" #'ceamx-code-prefix)
  "C-c l f" (cons "folding..." (define-prefix-command 'ceamx-code-f-prefix))
  "C-c l F" (cons "formatting..." (define-prefix-command 'ceamx-code-F-prefix))
  ;; "C-c m"
  "C-c n" (cons "[ NOTES     ]" #'ceamx-note-prefix)
  "C-c o" (cons "[ LAUNCH    ]" #'ceamx-launch-prefix)
  "C-c p" (cons "[ COMPLETE  ]" #'ceamx-completion-prefix)
  "C-c q" (cons "[ SESSION   ]" #'ceamx-session-prefix)
  ;; "C-c r"
  ;; "C-c s" (cons "[ ]")
  "C-c t" (cons "[ TOGGLE    ]" #'ceamx-toggle-prefix)
  ;; "C-c u"
  ;; "C-c v"
  "C-c w" (cons "[ WORKSPACE ]" #'ceamx-window-prefix)
  ;; "C-c x"
  ;; "C-c y"
  ;; "C-c z"
  )
#+end_src

* Features
:PROPERTIES:
:ID:       0b88377f-2539-49a1-917d-2d2eac806e37
:END:
** User Interface & Appearance :ui:
:PROPERTIES:
:header-args: :tangle lisp/ceamx-init-ui.el
:VISIBILITY: folded
:ID:       565cc0f1-4f0a-4435-8efc-9f6ee3df4e10
:END:

*** Requirements
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-ui.el :comments no
  ;; -*- lexical-binding: t;  -*-

  (require 'ceamx-lib)
  (require 'ceamx-ui)
#+end_src

*** Configure cursor appearance

#+begin_src emacs-lisp
(package! cursory
  (require 'cursory)

  (def-hook! ceamx-init-theme-cursory-h ()
    'ceamx-after-init-hook
    "Enable `cursory-mode' and load the latest preset."
    (cursory-mode 1)
    (cursory-set-preset (or (cursory-restore-latest-preset) 'box)))

  (setopt cursory-latest-state-file
          (expand-file-name "cursory-latest-state.eld" ceamx-var-dir))

  (setopt cursory-presets
          '((box
             :blink-cursor-interval 0.8)
            (box-no-blink
             :blink-cursor-mode -1)
            (bar
             :cursor-type (bar . 2)
             :blink-cursor-interval 0.8)
            (bar-no-other-window
             :inherit bar
             :cursor-in-non-selected-windows nil)
            (bar-no-blink
             :cursor-type (bar . 2)
             :blink-cursor-mode -1)
            (t
             :cursor-type box
             :cursor-in-non-selected-windows hollow
             :blink-cursor-mode 1
             :blink-cursor-blinks 10
             :blink-cursor-interval 0.2
             :blink-cursor-delay 0.2))))
#+end_src

