config.org
*** Customize the Customization buffers and menus

#+begin_src emacs-lisp
(setopt custom-theme-allow-multiple-selections nil)

(setopt custom-unlispify-menu-entries nil)
(setopt custom-unlispify-tag-names nil)
(setopt custom-unlispify-remove-prefixes nil)

(add-hook 'Custom-mode-hook #'custom-toggle-hide-all-widgets nil t)
#+end_src

*** Load common interface toolkits

Required as dependencies for multiple packages, including some
packages (like ~nix-mode~) who don't properly declare their
dependencies.

**** =grid=: textual data table presentation

- Source :: [[https://github.com/ichernyshovvv/grid.el][ichernyshovvv/grid.el]]
- Retrieved :: [2024-06-07 Fri 11:45]

#+begin_quote
This library allows you to put text data into boxes and align them horizontally,
applying margin, padding, borders.
#+end_quote

#+begin_src emacs-lisp
(package! (grid :host github :repo "ichernyshovvv/grid.el"))
#+end_src

**** =hydra=

- Documentation :: <https://github.com/jerrypnz/major-mode-hydra.el/#pretty-hydra>

#+begin_src emacs-lisp
(package! hydra
  (require 'hydra))
(package! pretty-hydra)
#+end_src

**** =symbol-overlay= :: highlight symbols with keymap-enabled overlays

#+begin_src emacs-lisp
(package! symbol-overlay)
#+end_src

**** =sideline= :: show information on the side
:PROPERTIES:
:ID:       556ce67a-0d8b-4ef3-8f01-d34e65faeed6
:END:

#+begin_src emacs-lisp
(package! sideline
  (require 'sideline)

  (setopt sideline-backends-left-skip-current-line t
          sideline-backends-right-skip-current-line t)
  (setopt sideline-order-left 'down
          sideline-order-right 'up)
  (setopt sideline-format-left "%s   "
          sideline-format-right "   %s")
  (setopt sideline-priority 100)
  (setopt sideline-display-backend-name t))
#+end_src

*** Theme :theme:
:PROPERTIES:
:ID:       34b88767-203e-4538-8832-2310328e8aa5
:END:

**** Consider all themes "safe"

#+begin_src emacs-lisp
(setopt custom-safe-themes t)
#+end_src

**** Add a custom hook ~ceamx-after-enable-theme-hook~ to run after enabling a theme
:PROPERTIES:
:ID:       ed7bff96-74c6-4476-bf4d-7909b077b839
:END:

- Source :: <https://github.com/jdtsmith/kind-icon/issues/34#issuecomment-1668560185>

#+begin_src emacs-lisp
(defvar ceamx-after-enable-theme-hook nil)

(defun ceamx-after-enable-theme (&rest _args)
  "Hook to run after enabling theme."
  (run-hooks 'ceamx-after-enable-theme-hook))

(advice-add 'enable-theme :after #'ceamx-after-enable-theme)
#+end_src

**** =standard-themes= :: themes like the default but more consistent
:PROPERTIES:
:ID:       09f2005b-1d4d-4d92-9f36-2327ca55757d
:END:

#+begin_src emacs-lisp
(when (display-graphic-p)
  (package! standard-themes
    (require 'standard-themes)))

(after! standard-themes
  (ceamx-ui-define-preferred-themes
   'standard 'standard-dark 'standard-light)

  (setopt standard-themes-bold-constructs t
          standard-themes-italic-constructs t)
  (setopt standard-themes-disable-other-themes t)
  (setopt standard-themes-mixed-fonts t
          standard-themes-variable-pitch-ui t)
  (setopt standard-themes-prompts '(extrabold italic))
  (setopt standard-themes-to-toggle (ceamx-ui-theme-family-preferred-themes 'standard))
  (setopt standard-themes-to-rotate
          '(standard-dark
            standard-dark-tinted
            standard-light
            standard-light-tinted)))
#+end_src

**** =modus-themes= :: accessible theme conforming to WCAG AAA
:PROPERTIES:
:ID:       3700042e-1b73-416f-aaa1-2cbd9f2101f0
:END:

- Website :: <https://protesilaos.com/modus-themes/>

#+begin_src emacs-lisp
(package! modus-themes
  (require 'modus-themes)

  (ceamx-ui-define-preferred-themes
   'modus 'modus-vivendi-tinted 'modus-operandi)

  (setopt modus-themes-italic-constructs t
          modus-themes-bold-constructs t
          modus-themes-mixed-fonts t
          modus-themes-variable-pitch-ui t)
  (setopt modus-themes-to-toggle
          (ceamx-ui-theme-family-preferred-themes 'modus))
  (setopt modus-themes-disable-other-themes nil)
  (setopt modus-themes-headings
          '((1 . (variable-pitch bold 1.1))
            (agenda-structure . (variable-pitch light 2.2))
            (agenda-date . (variable-pitch regular 1.3))
            (t . (variable-pitch semibold 1.0)))))
#+end_src

**** =ef-themes= :: colorful yet legible themes
:PROPERTIES:
:ID:       3f512af0-7bad-4447-a14d-08a5371e14c5
:END:

- Website :: <https://protesilaos.com/emacs/ef-themes>

#+begin_src emacs-lisp
(package! ef-themes
  (require 'ef-themes)

  (ceamx-ui-define-preferred-themes
   'ef 'ef-winter 'ef-frost)

  (setopt ef-themes-to-toggle (ceamx-ui-theme-family-preferred-themes 'ef))
  (setopt ef-themes-mixed-fonts t
          ef-themes-variable-pitch-ui t))
#+end_src

**** Configure the preferred themes

#+begin_src emacs-lisp
(use-feature! ceamx-ui
  :config
  (setopt ceamx-ui-theme-family 'ef))
#+end_src

**** Set approximate stomping coordinates for hyper-astronomic relativity calculations

#+begin_src emacs-lisp
(require 'cal-dst)

(setopt calendar-latitude 39.968)
(setopt calendar-longitude -75.133)
#+end_src

**** =circadian= :: theme phasing based on sunrise/sunset time
:PROPERTIES:
:ID:       badbc4d6-c784-4936-bd84-e1312a67273c
:END:

#+begin_src emacs-lisp
(package! circadian
  (require 'ceamx-ui)

  (if (eq 'solar ceamx-ui-theme-circadian-interval)
      (progn
        (add-hook 'ceamx-after-init-hook #'circadian-setup)

        (setopt circadian-themes `((:sunrise . ,ceamx-ui-theme-light)
                                   (:sunset . ,ceamx-ui-theme-dark))))
    (add-hook 'ceamx-after-init-hook
              (lambda ()
                (if (ceamx-ui-desktop-dark-theme-p)
                    (ceamx-ui/load-dark-theme)
                  (ceamx-ui/load-light-theme))))))
#+end_src

*** =avy= :: can do anything
:PROPERTIES:
:ID:       05cb2761-07fc-476b-8b78-0d08e0a89469
:END:

+ Package :: <https://github.com/abo-abo/avy>
+ Article :: <https://karthinks.com/software/avy-can-do-anything/>

#+begin_src emacs-lisp
(package! avy
  (defer! 2 (require 'avy))

  (define-keymap :keymap (current-global-map)
    "C-;" #'avy-goto-char-timer
    ;; "C-'" is reserved for special commands e.g. `avy-org-goto-heading-timer'

    "M-g w" #'avy-goto-word-1)

  (after! org
    (keymap-set org-mode-map "C-'" #'avy-org-goto-heading-timer)
    (keymap-set org-mode-map "C-\"" #'avy-org-refile-as-child)))

(after! avy
  (setopt avy-style 'at-full)
  (setopt avy-all-windows t)
  (setopt avy-case-fold-search t)

  ;; Prevent conflicts with themes.
  (setopt avy-background nil)

  ;; Anything lower feels unusable.
  (setopt avy-timeout-seconds 0.25))
#+end_src

*** Highlight current line in programming modes

#+begin_src emacs-lisp
(add-hook 'prog-mode-hook #'hl-line-mode)

(after! hl-line
  ;; Disable line highlight in unfocused windows.
  (setopt hl-line-sticky-flag nil))
#+end_src

*** =lin= :: improve line-highlighting for major-modes orientated around line selection

#+begin_src emacs-lisp
(package! lin
  (add-hook 'ceamx-after-init-hook #'lin-global-mode))
#+end_src

*** =pulsar= :: pulse current line after function invocations

#+begin_src emacs-lisp
(package! pulsar
  (add-hook 'ceamx-after-init-hook #'pulsar-global-mode)
  (add-hook 'minibuffer-setup-hook #'pulsar-pulse-line))

(after! pulsar
  (setopt pulsar-pulse t
          pulsar-delay 0.055
          pulsar-iterations 10)
  (setopt pulsar-face 'pulsar-magenta
          pulsar-highlight-face 'pulsar-cyan)

  (dolist (fn '(pulsar-pulse-line-red
                pulsar-recenter-top
                pulsar-reveal-entry))
    (add-hook 'next-error-hook #'fn)))
#+end_src

*** Window highlighting

#+begin_src emacs-lisp
(setopt highlight-nonselected-windows nil)
#+end_src

*** Hide frame decorations
:PROPERTIES:
:ID:       c532e9e7-8729-4442-8bd7-2c50717a9dc7
:END:

#+begin_src emacs-lisp
(unless (ceamx-host-macos-p)
  (add-to-list 'default-frame-alist '(undecorated . t)))

(when (ceamx-host-macos-p)
  ;; `undecorated-round' is macOS-specific.
  (add-to-list 'default-frame-alist '(undecorated-round . t))

  ;; GUI menu bar is necessary otherwise Emacs will be treated as a
  ;; non-application OS window (e.g. no focus capture).
  ;; <https://github.com/doomemacs/doomemacs/blob/d657be1744a1481dc4646d0b62d5ee1d3e75d1d8/lisp/doom-start.el#L118-L128>
  (def-hook! ceamx-frame--maybe-restore-gui-menu-bar-h (&optional frame)
    '(after-make-frame-functions window-setup-hook)
    "TODO: Provide source for this approach (Doom?), and why it does what it does."
    (when-let (frame (or frame (selected-frame)))
      (when (display-graphic-p frame)
        (set-frame-parameter frame 'menu-bar-lines 1))))

  ;; Stop C-z from minimizing windows.
  (keymap-global-unset "C-z" t))
#+end_src

