config.org
*** =spacious-padding= :: a comfortable layout density

#+begin_src emacs-lisp
(package! spacious-padding
  (add-hook 'ceamx-after-init-hook #'spacious-padding-mode))

(after! spacious-padding
  (setopt spacious-padding-widths
          '( :internal-border-width 20
             :header-line-width 4
             :mode-line-width 6
             :tab-width 4
             :right-divider-width 20
             :scroll-bar-width 8
             :left-fringe-width 12
             :right-fringe-width 12))

  (setopt spacious-padding-subtle-mode-line t))
#+end_src

*** =olivetti= :: "distraction-free" editing

- Package :: <https://github.com/rnkn/olivetti>

#+begin_src emacs-lisp
(package! olivetti
  (keymap-set ctl-x-x-map "o" #'olivetti-mode))

(after! olivetti
  (setopt olivetti-body-width 0.7
          olivetti-minimum-body-width 80
          olivetti-recall-visual-line-mode-entry-state t))
#+end_src

*** =logos= :: a simple focus mode with page breaks or outlines :present:
:PROPERTIES:
:ID:       9f620970-a54b-46bf-bbc4-ad3712646506
:END:

#+begin_src emacs-lisp
(package! logos
  (define-keymap :keymap (current-global-map)
    "C-x n N" #'logos-narrow-dwim

    "C-x ]" #'logos-forward-page-dwim
    "C-x [" #'logos-backward-page-dwim)

    "M-]" #'logos-forward-page-dwim
    "M-[" #'logos-backward-page-dwim)

(after! logos
  (setopt logos-outlines-are-pages t)
  (setopt logos-outline-regexp-alist
          `((emacs-lisp-mode . ,(format "\\(^;;;+ \\|%s\\)" logos-page-delimiter))
            (org-mode . ,(format "\\(^\\*+ +\\|^-\\{5\\}$\\|%s\\)" logos-page-delimiter))
            (markdown-mode . ,(format "\\(^\\#+ +\\|^[*-]\\{5\\}$\\|^\\* \\* \\*$\\|%s\\)" logos-page-delimiter))
            (conf-toml-mode . "^\\[")))

  ;; These apply buffer-locally when `logos-focus-mode' is enabled.
  (setq-default logos-hide-cursor t
                logos-hide-mode-line t
                logos-hide-header-line t
                logos-hide-buffer-boundaries t
                logos-hide-fringe t
                logos-variable-pitch t
                logos-buffer-read-only nil
                logos-scroll-lock nil
                logos-olivetti t)

  (add-hook 'enable-theme-functions #'logos-update-fringe-in-buffers)

  (def-hook! ceamx-essentials-logos-recenter-top-h ()
    '(logos-page-motion-hook)
    "Place point at the top when changing pages in non-`prog-mode' modes."
    (unless (derived-mode-p 'prog-mode)
      ;; NOTE: '0' value will recenter at the absolute top.
      (recenter 1))))
#+end_src

*** =focus= :: a lexical focus mode

+ Package :: <https://github.com/larstvei/Focus>

Focusing by sentence, paragraph, or code block.

#+begin_src emacs-lisp
;; TODO: keybindings to C-c t z as prefix
(package! focus
  (define-keymap :keymap ceamx-toggle-prefix
    "Z" #'focus-mode))
#+end_src

*** =moc= :: "Master of Ceremonies" presentation utilities :present:

+ Package :: <https://github.com/positron-solutions/moc/>

#+begin_src emacs-lisp
(package! (moc :host github :repo "positron-solutions/moc"))
#+end_src

*** Allow restoring deleted frames

#+begin_src emacs-lisp
(undelete-frame-mode 1)
#+end_src
*** Customize menu bar appearance :menubar:

Disable the menu bar by default:

#+begin_src emacs-lisp
(menu-bar-mode -1)
#+end_src

*** Customize tab bar appearance :tabs:

Enable the tab bar:

#+begin_src emacs-lisp
(tab-bar-mode 1)

(setopt tab-bar-auto-width t
        tab-bar-auto-width-max '((120) 20))
#+end_src

*** Typography :font:
**** Text rendering and scaling

#+begin_src emacs-lisp
(setq x-underline-at-descent-line nil)

(setq-default text-scale-remap-header-line t)
#+end_src

**** =fontaine= :: pre-configure font presets
:PROPERTIES:
:ID:       a007fa6e-ea76-4a29-86a2-7ff87885c0c1
:END:

<https://protesilaos.com/emacs/fontaine>

TIP: You can test out alterations quickly with, for example:
     (internal-set-lisp-face-attribute 'default :weight 'semilight)

#+begin_src emacs-lisp
(package! fontaine
  (when (display-graphic-p)
    (def-hook! ceamx-init-theme-activate-fontaine-h ()
      'ceamx-after-init-hook
      "Activate `fontaine-mode' with the last-saved preset.
If there is no previous preset state to load, fall back to the
\"regular\" preset."
      (fontaine-mode)
      (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular)))))

(after! fontaine
  (setopt fontaine-latest-state-file
          (expand-file-name "fontaine-latest-state.eld" ceamx-var-dir))

  ;; For some reason I do not yet understand, according to some
  ;; hearsay, font sizes best scale in multiples of 3-point
  ;; increments.
  (setopt fontaine-presets
          `((tiny
             :bold-weight medium
             :default-height ,(pcase (system-name)
                               (_ 78))
             :default-weight ,(pcase (system-name)
                               (_ 'semilight)))

            (small
             :bold-weight semibold
             :default-height ,(pcase (system-name)
                               (_ 90))
             :default-weight ,(pcase (system-name)
                               (_ 'regular)))

            (regular
             :bold-weight semibold)

            (medium
             :default-height ,(pcase (system-name)
                               ("boschic" 124)
                               (_ 120)))

            (large
             :default-height ,(pcase (system-name)
                               (_ 144)))

            (xlarge
             :default-height ,(pcase (system-name)
                               (_ 156)))

            (big-mclarge-huge
             :default-weight semilight
             :default-height ,(pcase (system-name)
                               (_ 180))
             :bold-weight extrabold)

            (t
             :default-family "Aporetic Sans Mono"
             :default-weight regular
             :default-height ,(pcase (system-name)
                               ("tuuvok" 102)
                               (_ 105))

             :fixed-pitch-family "Aporetic Sans Mono"
             :fixed-pitch-weight nil
             :fixed-pitch-height 1.0

             :fixed-pitch-serif-family nil
             :fixed-pitch-serif-weight nil
             :fixed-pitch-serif-height 1.0

             :variable-pitch-family "Aporetic Serif Mono"
             :variable-pitch-weight nil
             :variable-pitch-height 1.0

             :mode-line-active-family nil
             :mode-line-active-weight nil
             :mode-line-active-height 0.9

             :mode-line-inactive-family nil
             :mode-line-inactive-weight nil
             :mode-line-inactive-height 0.9

             :header-line-family nil
             :header-line-weight nil
             :header-line-height 0.9

             :line-number-family nil
             :line-number-weight nil
             :line-number-height 0.9

             :tab-bar-family nil
             :tab-bar-weight nil
             :tab-bar-height 1.0

             :bold-family nil
             :bold-weight bold

             :italic-family nil
             :italic-weight nil
             :italic-slant italic

             :line-spacing nil))))
#+end_src

**** ~ligature.el~ :: improved ligature support
:PROPERTIES:
:ID:       faf642cc-811e-4b58-bbaa-51e9e11b1dff
:END:

+ Package :: <https://github.com/mickeynp/ligature.el>

A better implementation of ligature support than the builtin
~prettify-symbols-mode~.

<https://old.reddit.com/r/emacs/comments/keji66/what_is_bad_about_prettifysymbolsmode/>

#+begin_src emacs-lisp
(package! ligature
  (when (display-graphic-p)
    (after! fontaine
      (global-ligature-mode 1))))

(after! ligature
  ;; Enable all Iosevka ligatures in programming modes.
  ;; <https://github.com/mickeynp/ligature.el/wiki#iosevka>
  (ligature-set-ligatures
   'prog-mode
   '("<---" "<--"  "<<-" "<-" "->" "-->" "--->" "<->" "<-->" "<--->"
     "<---->" "<!--" "<==" "<===" "<=" "=>" "=>>" "==>" "===>" ">="
     "<=>" "<==>" "<===>" "<====>" "<!---" "<~~" "<~" "~>" "~~>"
     "::" ":::" "==" "!=" "===" "!==" ":=" ":-" ":+" "<*" "<*>"
     "*>" "<|" "<|>" "|>" "+:" "-:" "=:" "<******>" "++" "+++")))
#+end_src

