config.org
**** =show-font= :: a tool to preview fonts

+ Package :: <https://protesilaos.com/emacs/show-font>

  #+begin_src emacs-lisp
(when (display-graphic-p)
  (package! show-font)

  (after! show-font
    (setopt show-font-pangram 'ceamx)
    (setopt show-font-character-sample
            "
ABCDEFGHIJKLMNOPQRSTUVWXYZ
abcdefghijklmnopqrstuvwxyz
0123456789   !@#$¢%^&*~|
`'\"‘’“”.,;:  ()[]{}—-_+=<>

()[]{}<>«»‹› 6bB8&0ODdoa 1tiIlL|\/
!ij c¢ 5$Ss 7Z2z 9gqp nmMNNMW uvvwWuuw
x×X .,·°;:¡!¿?`'‘’   ÄAÃÀ TODO
")))
#+end_src

*** Iconography & Symbolisms :icons:
:PROPERTIES:
:ID:       8732b348-e123-4f0b-b499-49b81bf750d9
:END:
**** Provide common dependency: ~nerd-icons~ :package:
:PROPERTIES:
:ID:       0eb3c103-ba4b-40ee-9341-e5cab30e075f
:END:

#+begin_src emacs-lisp
(package! nerd-icons
  (require 'nerd-icons)

  (keymap-set ceamx-insert-prefix "I" #'nerd-icons-insert)

  (define-keymap :keymap (current-global-map)
    "C-x 8 i" (cons "icons" (define-prefix-command 'ceamx-insert-icons-prefix 'ceamx-insert-icons-prefix-map))
    "C-x 8 i i" #'nerd-icons-insert))

(after! nerd-icons
  (setopt nerd-icons-font-family "Symbols Nerd Font Mono"))
#+end_src

**** Provide common dependency: ~svg-lib~ :package:

#+begin_src emacs-lisp
(package! svg-lib)
#+end_src

**** =page-break-lines= :: improve appearance of form feed characters :package:

- docs :: <https://github.com/purcell/page-break-lines/blob/master/README.md>

#+begin_src emacs-lisp
(package! page-break-lines
  (add-hook 'ceamx-after-init-hook #'global-page-break-lines-mode))
#+end_src

**** TODO ~svg-tag-mode~: Decorate buffer elements with SVG :package:
:PROPERTIES:
:header-args: :tangle no
:END:

- Source :: <https://github.com/Icy-Thought/emacs.d/blob/main/config.org#svg-tag-decorating-buffers-with-svg>

#+begin_src emacs-lisp
(package! svg-tag-mode
  (add-hook 'prog-mode-hook #'svg-tag-mode)
  (add-hook 'text-mode-hook #'svg-tag-mode))
#+end_src

*** Provide the ~ceamx-init-ui~ feature
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-ui.el :comments no
(provide 'ceamx-init-ui)
;;; ceamx-init-ui.el ends here
#+end_src

** Modeline :modeline:
:PROPERTIES:
:header-args: :tangle lisp/ceamx-init-modeline.el
:VISIBILITY: folded
:ID:       7e592f24-8ad1-4432-862a-5873a7bb18dd
:END:

*** Requirements
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-modeline.el :comments no
;; -*- lexical-binding: t; -*-

(require 'ceamx-lib)
#+end_src

*** =mlscroll= :: scrollbar for the modeline

#+begin_src emacs-lisp
(package! mlscroll
  (mlscroll-mode 1))
#+end_src

*** =minions= :: minimize many mode-line minor-modes
:PROPERTIES:
:ID:       af187c9b-e6b2-47dc-a1b0-848a38455d74
:END:

#+begin_src emacs-lisp
(package! minions
  (minions-mode 1)
  (setopt minions-prominent-modes
          '(auto-tangle-mode
            jinx-mode
            which-key-mode)))
#+end_src

*** Set up the ~ceamx-modeline~
:PROPERTIES:
:ID:       e8fa729f-3a84-4b3b-88eb-450406dde0a5
:END:

#+begin_src emacs-lisp
(line-number-mode 1)
(column-number-mode 1)

(setopt display-time-24hr-format t)

(use-feature! ceamx-modeline
  :hook (ceamx-after-init . ceamx-modeline-mode)
  :init
  (keymap-set ceamx-toggle-prefix "m" #'ceamx-modeline-mode)
  :config
  (setq-default mode-line-format
                '("%e"
                  ceamx-modeline-kbd-macro
                  ceamx-modeline-narrow
                  ceamx-modeline-remote-status
                  ceamx-modeline-window-dedicated-status
                  " "
                  ceamx-modeline-buffer-identification
                  " "
                  ceamx-modeline-major-mode
                  " "
                  ceamx-modeline-position
                  ceamx-modeline-process
                  " "
                  (project-mode-line project-mode-line-format)
                  ceamx-modeline-vc-branch
                  " "
                  ceamx-modeline-eglot
                  " "
                  ;; ceamx-modeline-flymake
                  " "
                  mode-line-format-right-align ; Emacs 30
                  mode-line-modes
                  " "
                  ceamx-modeline-format-on-save
                  ;; ceamx-modeline-notmuch-indicator
                  " "
                  ceamx-modeline-misc-info
                  ;;ceamx-modeline-scrollbar
                  )))
#+end_src

*** =keycast= :: show current command and its binding :present:

- Website :: <https://github.com/tarsius/keycast>

Supports display in the mode-line, header-line, tab-bar, and as
messages in a dedicated frame.

NOTE: Incompatible with kitchen-sink modeline packages like
=doom-modeline= and =telephone-line=.

#+begin_src emacs-lisp
(after! keycast
  (dolist (input '(self-insert-command org-self-insert-command))
    (add-to-list 'keycast-substitute-alist `(,input "." "Typing…")))

  (dolist (event '(mouse-event-p mouse-movement-p mwheel-scroll))
    (add-to-list 'keycast-substitute-alist `(,event nil))))
#+end_src

*** Provide the ~ceamx-init-modeline~ feature
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-modeline.el :comments no
(provide 'ceamx-init-modeline)
;;; ceamx-init-modeline.el ends here
#+end_src

** Essentials
:PROPERTIES:
:header-args: :tangle lisp/ceamx-init-essentials.el
:VISIBILITY: folded
:ID:       befd5701-44ee-4324-9a6c-63e39bd5e459
:END:

*** Requirements
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-essentials.el :comments no
;; -*- lexical-binding: t; -*-
#+end_src

*** Baseline configurations
:PROPERTIES:
:ID:       9d89d38e-1fa6-41e5-b5a7-8c1c3422a34c
:END:

#+begin_src emacs-lisp
;; Increase number of messages saved in log.
(setopt message-log-max 10000)

;; "A second, case-insensitive pass over `auto-mode-alist' is time wasted."
(setopt auto-mode-case-fold nil)

(define-keymap :keymap (current-global-map)
  "M-c" #'capitalize-dwim
  "M-f" #'forward-word
  "M-F" #'forward-symbol
  "M-l" #'downcase-dwim
  "M-o" #'delete-blank-lines
  "M-Q" #'repunctuate-sentences
  "M-u" #'upcase-dwim
  "M-z" #'zap-up-to-char              ; orig: `zap-to-char'
  "M-=" #'count-words
  "M-SPC" #'cycle-spacing

  "C-h F" #'apropos-function
  "C-h L" #'apropos-library
  "C-h U" #'apropos-user-option
  "C-h V" #'apropos-variable

  ;; TODO: move to window config
  "C-x O" #'next-multiframe-window

  ;; Minimizing frames is the job of the window manager.
  "C-x C-z" nil)

;; Keymap for buffers
;; TODO: copy some of these to `ceamx-toggle-prefix'
(define-keymap :keymap ctl-x-x-map
  "f" #'follow-mode
  "l" #'visual-line-mode
  "r" #'rename-uniquely)


#+end_src

*** =ceamx-simple=: Simple & common commands
:PROPERTIES:
:ID:       3fcbca20-29f3-4e91-ba76-6bad1199adc3
:END:

#+begin_src emacs-lisp
(use-feature! ceamx-simple
  :demand t

  :config
  (define-keymap :keymap ceamx-file-prefix
  ;; TODO
  ;; "y" #'+yank-this-file-name

  "c" '("copy..." . ceamx-simple/copy-current-file)
  "d" '("delete" . ceamx-simple/delete-current-file)
  "f" #'find-file
  "F" #'find-file-other-window
  "r" '("move..." . ceamx-simple/move-current-file)
  "s" #'save-buffer
  "U" #'ceamx-simple/sudo-find-file

  "C-d" '("diff with..." . ceamx-simple/diff-with-file))

  (define-keymap :keymap ceamx-insert-prefix
    "d" #'ceamx-simple/insert-date)

  (define-keymap :keymap (current-global-map)
    "ESC ESC" #'ceamx/keyboard-quit-dwim
    "C-g" #'ceamx/keyboard-quit-dwim

    "C-x k" #'ceamx-simple/kill-current-buffer ; orig: `kill-buffer'
    "C-x K" #'kill-buffer

    ;; FIXME: move defun to `ceamx-simple'
    "M-DEL" #'ceamx/backward-kill-word

    "C-M-SPC" #'ceamx-simple/mark-sexp

    ;; Commands for lines
    ;; TODO: currently `easy-kill'
    ;; "M-w" #'ceamx-simple/kill-ring-save
    "M-k" #'ceamx-simple/kill-line-backward
    "C-S-d" #'ceamx-simple/duplicate-line-or-region
    ;; TODO: redundant with `easy-kill'
    "C-S-w" #'ceamx-simple/copy-line
    "C-S-y" #'ceamx-simple/yank-replace-line-or-region
    "C-RET" #'ceamx-simple/new-line-below
    "C-S-RET" #'ceamx-simple/new-line-above

    ;; Commands for text insertion or manipulation
    "C-<" #'ceamx-simple/escape-url-dwim
    "M-Z" #'ceamx-simple/zap-to-char-backward

    ;; Commands for buffers
    "M-s b" #'ceamx-simple/buffers-major-mode
    "M-s v" #'ceamx-simple/buffers-vc-root)

  (define-keymap :keymap prog-mode-map
    "M-RET" #'ceamx-simple/continue-comment)

  (keymap-substitute (current-global-map)
                     #'default-indent-new-line
                     #'ceamx-simple/continue-comment))
#+end_src

*** =crux= :: a [c]ollection of [r]idiculously [u]seful e[x]tensions
:PROPERTIES:
:ID:       5fe13339-e827-421a-a059-f0fea7bff481
:END:

#+begin_src emacs-lisp
(package! crux
  (define-keymap :keymap (current-global-map)
    "C-k" #'crux-smart-kill-line
    "C-^" #'crux-top-join-line

    "C-x 4 t" #'crux-transpose-windows

    "C-S-d" #'crux-duplicate-current-line-or-region
    "C-S-RET" #'crux-smart-open-line-above
    "C-M-S-d" #'crux-duplicate-and-comment-current-line-or-region

    "M-o" #'crux-other-window-or-switch-buffer ; orig. `delete-blank-lines'

    "S-RET" #'crux-smart-open-line)

  (define-keymap :keymap ceamx-buffer-prefix
    "f" #'crux-cleanup-buffer-or-region
    "M-w" #'crux-kill-buffer-truename)

  (define-prefix-command 'ceamx-region-prefix 'ceamx-region-prefix-map)

  (keymap-global-set "C-c r" #'ceamx-region-prefix)

  (define-keymap :keymap ceamx-region-prefix-map
    "f" #'crux-cleanup-buffer-or-region
    "TAB" #'crux-indent-rigidly-and-copy-to-clipboard)

  (define-keymap :keymap ceamx-file-prefix
    "c" #'crux-copy-file-preserve-attributes
    "d" #'crux-delete-file-and-buffer
    "r" #'crux-rename-file-and-buffer))
#+end_src

*** =tmr= :: set timers using a convenient notation
:PROPERTIES:
:ID:       67caf305-67ce-42b5-9ff3-98b0f9ac6b06
:END:

+ Website :: <https://protesilaos.com/emacs/tmr>

#+begin_src emacs-lisp
(package! tmr
  (require 'tmr)

  (keymap-global-set "C-c T" #'tmr-prefix-map)

  (setopt tmr-notification-urgency 'normal)
  (setopt tmr-description-list 'tmr-description-history)

  (defvar-keymap ceamx+embark-tmr-action-map
    :doc "Action map for TMRs, which can be utilized by Embark."
    "k" #'tmr-remove
    "r" #'tmr-remove
    "R" #'tmr-remove-finished
    "c" #'tmr-clone
    "a" #'tmr-toggle-acknowledge
    "e" #'tmr-edit-description
    "s" #'tmr-reschedule)

  (defvar embark-keymap-alist)
  (defvar embark-post-action-hooks)

  (after! embark
    (add-to-list 'embark-keymap-alist '(tmr-timer . ceamx+embark-tmr-action-map))
    (cl-loop
     for cmd the key-bindings of ceamx+embark-tmr-action-map
     if (commandp cmd) do
     (add-to-list 'embark-post-action-hooks (list cmd 'embark--restart)))))
#+end_src

*** =persistent-scratch= :: Preserve the scratch buffer across sessions
:PROPERTIES:
:ID:       a85e81df-a194-4ecf-b1ca-5d95279cb45f
:END:

#+begin_src emacs-lisp
(package! persistent-scratch
  (persistent-scratch-setup-default))
#+end_src

*** Configure sane window-scrolling behavior

#+begin_src emacs-lisp
(use-feature! window
  :bind
  ("C-x <" . scroll-right)
  ("C-x >" . scroll-left)
  ("<wheel-left>" . scroll-left)
  ("<wheel-right>" . scroll-right)

  :config
  ;; Available cycle positions for `recenter-top-bottom'.
  ;; (setopt recenter-positions '(top middle bottom))
  (setopt recenter-positions '(middle top bottom)) ; default

  ;; Horizontally-scroll only the current line when point column moves
  ;; beyond window boundaries.
  (setopt auto-hscroll-mode 'current-line)

  (setopt scroll-error-top-bottom t
          ;; Prevent unwanted horizontal scrolling upon navigation.
          scroll-preserve-screen-position t
          scroll-conservatively 10000)

  ;; Add a margin when scrolling vertically (or don't).
  (setq-default scroll-margin 1))
#+end_src

