config.org
**** =helpful=: Provide improved alternatives to the builtin "describe" utilities

- Source code :: <https://github.com/Wilfred/helpful>

Note that there is a severe but edge-case bug that has gone unfixed
for quite a while.  ~helpful~ cannot display documentation for symbols
defined in Emacs C source code:

<https://github.com/Wilfred/helpful/issues/329>

#+begin_src emacs-lisp
(package! helpful
  (defer! 1
    (require 'helpful))

  (define-keymap :keymap help-map
    "c" #'helpful-callable
    "C" #'helpful-command
    "f" #'helpful-function              ; orig: `describe-face'
    "F" #'describe-face
    "h" #'helpful-at-point
    "K K" #'helpful-key
    "o" #'helpful-symbol
    "v" #'helpful-variable))

#+end_src

*** History & Undo
**** Record some variables' values with ~savehist~

#+begin_src emacs-lisp
(use-feature! savehist
  :init
  (savehist-mode)

  :config
  (cl-dolist (save '(kill-ring
                     regexp-search-ring
                     search-ring))
    (cl-pushnew save savehist-additional-variables))
  (setopt history-length 100
          history-delete-duplicates t)
  (setopt savehist-autosave-interval 60))
#+end_src

**** Record point position in buffers with ~saveplace~

#+begin_src emacs-lisp
(use-feature! saveplace
  :init
  (save-place-mode))
#+end_src

**** Record recently-accessed files with ~recentf~

#+begin_src emacs-lisp
(use-feature! recentf
  :init
  (recentf-mode)

  :config
  (setopt recentf-max-saved-items 50)   ; default => 20
  (setopt recentf-max-menu-items 15)    ; default => 10

  ;; Disable recentf-cleanup on Emacs start, because it can cause
  ;; problems with remote files.
  (setopt recentf-auto-cleanup 'never)

  ;; Exclude internal plumbing files.
  (dolist (path '(ceamx-etc-dir ceamx-var-dir))
    (add-to-list 'recentf-exclude path)))
#+end_src

**** Increase undo history limits

Advice from the author of ~undo-fu~:

#+begin_quote
The default undo limits for emacs are quite low _(0.15mb at time of
writing)_ undo-tree for example increases these limits.

On modern systems you may wish to use much higher limits.

This example sets the limit to 64mb, 1.5x (96mb) for the strong limit
and 10x (960mb) for the outer limit.  Emacs uses 100x for the outer
limit but this may be too high when using increased limits.
#+end_quote

via <https://codeberg.org/ideasman42/emacs-undo-fu#undo-limits>

#+begin_src emacs-lisp
(setopt undo-limit 67108864) ; 64mb.
(setopt undo-strong-limit 100663296) ; 96mb.
(setopt undo-outer-limit 1006632960) ; 960mb.
#+end_src

**** =undo-fu=: Support optional linear undo/redo

- Source code :: <https://codeberg.org/ideasman42/emacs-undo-fu>

#+begin_src emacs-lisp
(package! undo-fu
  (keymap-global-set "C-z" #'undo-fu-only-undo)
  (keymap-global-set "C-S-z" #'undo-fu-only-redo))
#+end_src

**** =undo-fu-session=: Record undo/redo steps across Emacs sessions

- Source code :: <https://codeberg.org/ideasman42/emacs-undo-fu-session>

NOTE: This is *NOT* just for use with ~undo-fu~!  It's an essential
enhancement to the builtin Emacs undo system as well.

#+begin_src emacs-lisp
(defvar undo-fu-session-directory
  (expand-file-name "undo-fu-session" ceamx-var-dir))

(package! undo-fu-session
  (setopt undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'"))
  (setopt undo-fu-session-ignore-temp-files t)
  (setopt undo-fu-session-ignore-encrypted-files t)

  (setopt undo-fu-session-compression 'zst)

  (undo-fu-session-global-mode))
#+end_src

**** =vundo=: Visualize the Emacs undo tree
:PROPERTIES:
:ID:       8fd3c7aa-cf9d-47f9-91cf-715e6f5d0618
:END:

- Source code :: <https://github.com/casouri/vundo>

#+begin_src emacs-lisp
(use-package vundo
  ;; :ensure t
  :defer t
  :defines vundo-unicode-symbols

  :bind
  ("C-x u" . vundo)

  :config
  (setopt vundo-glyph-alist vundo-unicode-symbols))
#+end_src

*** Bookmarks
**** =dogears=: Return to previously-visited buffer positions

- Source code :: <https://github.com/alphapapa/dogears.el>

#+begin_src emacs-lisp :tangle no
(package! dogears
  (add-hook 'on-first-buffer-hook #'dogears-mode)

  ;; Also see `ceamx/dogears-dispatch'.
  (define-keymap :keymap (current-global-map)
    ;; TODO: find a new binding maybe
    ;; "M-g d" #'dogears-go
    "M-g M-b" #'dogears-back
    "M-g M-f" #'dogears-forward
    "M-g M-d" #'dogears-list
    "M-g M-D" #'dogears-sidebar)

  ;; Persist `dogears-list' between Emacs sessions.
  ;; via <https://github.com/alphapapa/dogears.el/issues/4>
  (after! savehist
    (when (boundp 'savehist-additional-variables)
      (add-to-list 'savehist-additional-variables #'dogears-list))))

;; TODO: provide a little more context in transient (label for dogears, links maybe...)
(after! (transient dogears)
  (transient-define-prefix ceamx/dogears-dispatch ()
    "Transient menu for `dogears' history navigation commands."
    [["Navigate"
      ("b" "back" dogears-back :transient transient--do-stay)
      ("f" "forward" dogears-forward :transient transient--do-stay)]
     ;; TODO: when quit one of these Find commands, return to transient
     ["Find"
      ("d" "go..." dogears-go)
      ("l" "list" dogears-list)
      ("S" "sidebar" dogears-sidebar)]])

  (defer-until! (fboundp 'ceamx/dogears-dispatch)
    (keymap-global-set "M-g d" #'ceamx/dogears-dispatch)))
#+end_src

*** =which-key=

#+begin_src emacs-lisp
(use-feature! which-key
  :hook (ceamx-after-init . which-key-mode)

  :config
  (setopt which-key-compute-remaps t)
  (setopt which-key-idle-delay 1.0)
  (setopt which-key-sort-order 'which-key-prefix-then-key-order
          which-key-sort-uppercase-first nil)

  ;; The default (0) is difficult to read.
  (setopt which-key-add-column-padding 2)

  ;; FIXME: no effect? what does this actually do?
  (setopt which-key-show-remaining-keys t))
#+end_src

*** macOS: Remap modifier keys for the Apple keyboard layout

#+begin_src emacs-lisp
(when (and (ceamx-host-macos-p) (display-graphic-p))
  (setopt mac-control-modifier 'control)
  (setopt mac-option-modifier 'meta)
  (setopt ns-option-modifier 'meta)
  (setopt mac-command-modifier 'super)
  (setopt ns-command-modifier 'super)
  ;; Free up the right-side option key for character composition.
  (setopt mac-right-option-modifier 'none)
  (setopt ns-right-option-modifier 'none)
  ;; Common system hotkeys.
  (define-keymap :keymap (current-global-map)
    "s-c" #'kill-ring-save
    "s-v" #'yank
    "s-x" #'kill-region
    "s-q" #'save-buffers-kill-emacs))
#+end_src

*** Enable and configure ~repeat-mode~

#+begin_src emacs-lisp
(add-hook 'ceamx-after-init-hook #'repeat-mode)

(after! repeat
  (setopt repeat-exit-timeout 10)
  (setopt repeat-on-final-keystroke t)
  (setopt repeat-keep-prefix t)
  (setopt repeat-exit-key "<return>"))
#+end_src

Related, but not technically part of ~repeat-mode~:

#+begin_src emacs-lisp
(setopt set-mark-command-repeat-pop t)
#+end_src

*** Provide ~ceamx-init-essentials~ feature

#+begin_src emacs-lisp
(provide 'ceamx-init-essentials)
;;; ceamx-init-essentials.el ends here
#+end_src

** Search :search:
:PROPERTIES:
:header-args: :tangle lisp/ceamx-init-search.el
:VISIBILITY: folded
:ID:       11946c45-0ed9-4f75-bbad-72ee57f1311b
:END:

Configuration for search-related utilities like ~isearch~ and
~query-replace~.

See also [[*CONSULTing completing-read]], as ~consult~ often provides a frontend to
these utilities.

- Source :: <https://github.com/karthink/.emacs.d/blob/6aa2e034ce641af60c317697de786bedc2f43a71/lisp/setup-isearch.el>

*** Requirements
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :comments no
;; -*- lexical-binding: t -*-

(require 'ceamx-lib)
#+end_src

*** Baseline search configuration

#+begin_src emacs-lisp
(use-feature! emacs
  :config
  (setopt find-library-include-other-files nil)

  (keymap-set search-map "r" '("replace..." . ceamx-replace-prefix)))
#+end_src

*** Configure interactive searching with ~isearch~

#+begin_src emacs-lisp
(after! isearch
  (blackout 'isearch)

  ;;
  ;; Settings

  (setopt search-highlight t
          isearch-lazy-highlight t
          lazy-highlight-initial-delay 0.5
          lazy-highlight-no-delay-length 4)
  (setopt isearch-lazy-count t
          lazy-count-prefix-format "[%s/%s] "
          lazy-count-suffix-format nil)
  (setopt isearch-allow-scroll 'unlimited)
  (setopt isearch-wrap-pause t
          isearch-repeat-on-direction-change t)

  ;; Allow extending search string by holding shift and using motion
  ;; commands.
  (setopt isearch-yank-on-move 'shift)

  (setopt search-whitespace-regexp ".*?"
          isearch-lax-whitespace t
          isearch-regexp-lax-whitespace nil)

  ;;
  ;; Keybindings

  (defvar-keymap isearch-repeat-map
    :repeat t
    "s" #'isearch-repeat-forward
    "r" #'isearch-repeat-backward)

  (define-keymap :keymap (current-global-map)
    "M-s M-o" #'multi-occur)

  (define-keymap :keymap isearch-mode-map
    "M-<" #'isearch-beginning-of-buffer
    "M->" #'isearch-end-of-buffer
    "M-/" #'isearch-complete
    "M-w" #'isearch-yank-word-or-char

    "M-s <" #'isearch-beginning-of-buffer
    "M-s >" #'isearch-end-of-buffer

    "C-g" #'isearch-cancel              ; orig. `isearch-abort'

    "C-w" nil
    "M-e" nil)

  (keymap-set minibuffer-local-isearch-map "M-/" #'isearch-complete-edit))
#+end_src

*** Customize the ~occur~ buffer

#+begin_src emacs-lisp
(after! isearch
  (add-hook 'occur-mode-hook #'ceamx-truncate-lines-silently)

  (setopt list-matching-lines-jump-to-current-line nil)

  (keymap-set occur-mode-map "t" #'toggle-truncate-lines))
#+end_src

*** =visual-replace= :: a nicer ~query-replace~ interface
:PROPERTIES:
:ID:       cfb820fa-0418-44a0-bea6-53037da05af5
:END:

+ Repo :: <https://github.com/szermatt/visual-replace>

#+begin_src emacs-lisp
(package! visual-replace
  (visual-replace-global-mode)

  (define-keymap :keymap ceamx-replace-prefix
    "r" #'visual-replace-thing-at-point
    "R" #'visual-replace-selected)

  (after! isearch
    (keymap-set isearch-mode-map "M-%" #'visual-replace-from-isearch)))
#+end_src

*** =substitute= :: efficiently replace contextual targets

<https://protesilaos.com/emacs/substitute>

#+begin_src emacs-lisp
(package! substitute
  (define-keymap :keymap ceamx-replace-prefix
    "b" #'substitute-target-in-buffer
    "d" #'substitute-target-in-defun
    "s" #'substitute-target-above-point
    "S" #'substitute-target-below-point)

  (setopt substitute-hightlight t))

(after! substitute
  ;; Provide messages reporting on matches changed in the context.
  (add-hook 'substitute-post-replace-functions #'substitute-report-operation))
#+end_src

*** =wgrep= :: writable grep buffers
:PROPERTIES:
:ID:       db0ec455-df43-47da-9015-b22d48699027
:END:

+ Package :: <https://github.com/mhayashi1120/Emacs-wgrep>

#+begin_src emacs-lisp
(package! wgrep
  (after! wgrep
    (setopt wgrep-auto-save-buffer t))

  (after! grep-mode
    (keymap-set grep-mode-map "W" #'wgrep-change-to-wgrep-mode)))
#+end_src

*** TODO Use builtin ~grep-edit-mode~ instead of ~wgrep~ if available

*** Configure =re-builder=, the regular expression builder

<https://www.masteringemacs.org/article/re-builder-interactive-regexp-builder>
<https://francismurillo.github.io/2017-03-30-Exploring-Emacs-rx-Macro/>

Unfortunately, ~re-builder~ itself is poorly-documented.

#+begin_src emacs-lisp
(use-feature! re-builder
  :config
  ;; "string" => recommended: \\(foo\\\|bar\\)
  ;; "rx"     => recommended; advanced sexp regexp engine
  ;; "read"   => default, avoid: backslash hell
  (setopt reb-re-syntax 'string))
#+end_src

