config.org
*** Configure =xref=
:PROPERTIES:
:ID:       184ea61e-d07b-4af9-bb49-bcd539b38268
:END:

#+begin_src emacs-lisp
(defvar xref-ignored-files nil
  "List of files to be ignored by `xref'.")

(keymap-set ceamx-code-prefix "d" #'xref-find-definitions)

(after! xref
  (setopt xref-file-name-display 'project-relative)
  (setopt xref-prompt-for-identifier nil)
  (setopt xref-show-definitions-function #'xref-show-definitions-completing-read)
  (setopt xref-show-xrefs-function #'xref-show-definitions-buffer))
#+end_src

*** Provide the ~ceamx-init-search~ feature

#+begin_src emacs-lisp
(provide 'ceamx-init-search)
;;; ceamx-init-search.el ends here
#+end_src

** Dired, the Directory Editor :dired:
:PROPERTIES:
:header-args: :tangle lisp/ceamx-init-dired.el
:VISIBILITY: folded
:END:

*** Requirements
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-dired.el :comments no
;;; -*- lexical-binding: t -*-

(require 'ceamx-lib)
#+end_src

*** General Dired customizations

#+begin_src emacs-lisp

(setopt delete-by-moving-to-trash t)
(setopt mouse-drag-and-drop-region-cross-program t)

(after! dired
  (add-hook 'dired-mode-hook #'dired-hide-details-mode)
  (add-hook 'dired-mode-hook #'hl-line-mode)

  ;; cf. `dired-omit-files', `dired-omit-lines', `dired-omit-extensions'
  (add-hook 'dired-mode-hook #'dired-omit-mode)

  ;; -A => dotfiles without . and ..
  ;; -F => append special chars to special files
  ;; -G => omit group name
  ;; -h => human-readable file sizes
  ;; -l => long listing, required by dired
  ;; -v => sort files by version number, not lexicographic
  (setopt dired-listing-switches "-AGFhlv --group-directories-first --time-style=long-iso")

  (setopt dired-auto-revert-buffer #'dired-directory-changed-p)
  (setopt dired-do-revert-buffer (##not (file-remote-p %)))

  ;; When there are multiple Dired panes open, automatically use the
  ;; other pane as target for some actions (e.g. copying, moving).
  (setopt dired-dwim-target t)
  (setopt dired-kill-when-opening-new-dired-buffer t)
  (setopt dired-vc-rename-file t)
  (setopt dired-clean-confirm-killing-deleted-buffers nil)
  (setopt dired-clean-up-buffers-too t)
  (setopt dired-create-destination-dirs 'ask
          dired-create-destination-dirs-on-trailing-dirsep t
          dired-recursive-deletes 'always
          dired-recursive-copies 'always
          dired-backup-overwrite 'always)
  (setopt dired-free-space nil)
  (setopt dired-make-directory-clickable t)
  (setopt dired-mouse-drag-files t)

  ;;
  ;; Keybindings

  (define-keymap :keymap dired-mode-map
    "C-+" #'dired-create-empty-file
    "C-RET" #'dired-do-open))
#+end_src

*** =dired-subtree= :: insert subdirs arboreally

#+begin_src emacs-lisp
(package! dired-subtree
  (after! dired
    (define-keymap :keymap dired-mode-map
      "<tab>" #'dired-subtree-toggle
      "TAB" #'dired-subtree-toggle
      "<backtab>" #'dired-subtree-remove
      "S-TAB" #'dired-subtree-remove)))

(after! dired-subtree
  (setopt dired-subtree-use-backgrounds nil))
#+end_src

*** Writable Dired buffers with the ~wdired~ feature
:PROPERTIES:
:ID:       13d23c1b-2e7a-4562-a01a-4d922d8e7317
:END:

#+begin_src emacs-lisp
(after! dired
  (keymap-set dired-mode-map "C-c C-e" #'wdired-change-to-wdired-mode))

(after! wdired
  (keymap-set wdired-mode-map "C-c C-k" #'wdired-change-to-dired-mode)

  (setopt wdired-create-parent-directories t)
  (setopt wdired-allow-to-change-permissions t))
#+end_src
*** Preview images in Dired with the ~image-dired~ feature

#+begin_src emacs-lisp
(after! dired
  (keymap-set dired-mode-map "C-c t i" #'image-dired))

(after! image-dired
  (keymap-set image-dired-thumbnail-mode-map "RET" #'image-dired-thumbnail-display-external)

  (setopt image-dired-thumbnail-storage 'standard)
  (setopt image-dired-external-viewer "xdg-open")
  (setopt image-dired-thumb-relief 2
          image-dired-thumbs-per-row 4))
#+end_src

*** =trashed= :: interact with operating system trash diredly

#+begin_src emacs-lisp
(package! trashed)
(after! trashed
  (setopt trashed-action-confirmer #'y-or-n-p)
  (setopt trashed-use-header-line t)
  (setopt trashed-sort-key '("Date deleted" . t))
  (setopt trashed-date-format "%Y-%m-%d %H:%M:%S"))
#+end_src

*** =diredfl= :: additional syntax highlighting in dired buffers

+ Package :: <https://github.com/purcell/diredfl>

#+begin_src emacs-lisp
(package! diredfl
  (add-hook 'ceamx-after-init-hook #'diredfl-global-mode)
  (after! diredfl
    (set-face-attribute 'diredfl-dir-name nil :bold t)))
#+end_src

*** =nerd-icons-dired= :: icons for list items :icons:

#+begin_src emacs-lisp
(package! nerd-icons-dired
  (add-hook 'dired-mode-hook #'nerd-icons-dired-mode))
#+end_src

*** =dired-preview= :: a file previewer

+ Website :: <https://protesilaos.com/emacs/dired-preview>

#+begin_src emacs-lisp
(package! dired-preview
  (defer! 3
    (dired-preview-global-mode))
  (after! dired-preview
    (setopt dired-preview-delay 0.7)
    (setopt dired-preview-max-size (expt 2 20))
    (setopt dired-preview-ignored-extensions-regexp
            (concat "\\."
                    "\\(mkv\\|webm\\|mp4\\|mp3\\|ogg\\|m4a"
                    "\\|gz\\|zst\\|tar\\|xz\\|rar\\|zip"
                    "\\|iso\\|epub\\|pdf\\)"))

    (keymap-set dired-mode-map "C-c t p" #'dired-preview-mode)))
#+end_src

*** Provide the ~ceamx-init-dired~ feature

#+begin_src emacs-lisp :tangle lisp/ceamx-init-dired.el :comments no
(provide 'ceamx-init-dired)
;;; ceamx-init-dired.el ends here
#+end_src

** Completion :completion:
:PROPERTIES:
:header-args: :tangle lisp/ceamx-init-completion.el
:VISIBILITY: folded
:END:

*** Requirements

#+begin_src emacs-lisp :comments no
;; -*- lexical-binding: t -*-

(require 'ceamx-lib)
#+end_src

*** Minibuffer :minibuffer:
**** Baseline minibuffer settings
:PROPERTIES:
:ID:       2c5efde3-41fb-4154-bbc9-3921ad9a318b
:END:

#+begin_src emacs-lisp
(use-feature! minibuffer
  :hook ((ceamx-after-init . (minibuffer-depth-indicate-mode
                              minibuffer-electric-default-mode)))
  :config

  (setopt echo-keystrokes 0.25)
  (setopt savehist-save-minibuffer-history t)

  ;; Always resize mini-windows to fit their contents.
  (setopt resize-mini-windows t)
  ;; Hide commands in M-x which do not apply to the current mode.
  (setopt read-extended-command-predicate #'command-completion-default-include-p)

  (setopt minibuffer-prompt-properties
          '(read-only t
            cursor-intangible t         ; see `cursor-intangible-mode'
            face minibuffer-prompt))

  ;; TODO: isn't this handled somewhere else?  case-insensitive until
  ;; proven otherwise?
  ;; (setopt completion-ignore-case t
  ;;         read-buffer-completion-ignore-case t
  ;;         read-file-name-completion-ignore-case t)
  ;; (setq-default case-fold-search t)

  (setopt minibuffer-default-prompt-format " [%s]"))

(after! mb-depth
  (setopt enable-recursive-minibuffers t)
  ;; TODO: evaluate...
  (setopt read-minibuffer-restore-windows nil))
#+end_src

**** Add an indicator to the ~completing-read-multiple~ prompt
:PROPERTIES:
:ID:       6d74806b-359a-45e8-9090-b5b88640c900
:END:

#+begin_src emacs-lisp
;; Supported out of the box in Emacs 31 with `crm-prompt'.
(when (< emacs-major-version 31)
  (def-advice! ceamx-completion-crm-indicator-a (args)
    :filter-args #'completing-read-multiple
    "Add prompt indicator to `completing-read-multiple' for candidates ARGS.
We display [CRM<separator>], e.g., [CRM,] if the separator is a comma."
    (cons (format "[CRM%s] %s"
                  (string-replace "[ \t]*" "" crm-separator)
                  (car args))
          (cdr args))))
#+end_src

**** =vertico= :: [vert]ical [i]nteractive [co]mpletion
:PROPERTIES:
:ID:       4d5b4204-7e8e-4b11-87d1-5da6618f99ec
:END:

+ Package :: <https://github.com/minad/vertico>

#+begin_src emacs-lisp
(package! vertico
  (add-hook 'ceamx-after-init-hook #'vertico-mode)

  (setopt vertico-count 8
          vertico-cycle t
          vertico-resize t
          vertico-scroll-margin 0)

  (after! (vertico savehist)
    (add-hook 'minibuffer-setup-hook #'vertico-repeat-save)
    (add-to-list 'savehist-additional-variables #'vertico-repeat-history))

  ;; Tidy shadowed file names -- e.g. cleans `~/foo/bar///' to `/', and `~/foo/bar/~/' to `~/'.
  (add-hook 'rfn-eshadow-update-overlay-hook #'vertico-directory-tidy))

(after! vertico
  (define-keymap :keymap vertico-map
    "RET" #'vertico-directory-enter
    "DEL" #'vertico-directory-delete-char
    "M-DEL" #'vertico-directory-delete-word
    "M-q" #'vertico-quick-insert
    "C-j" #'vertico-insert
    "C-q" #'vertico-quick-exit))

(use-feature! ceamx-completion
  :after vertico
  :bind ( :map vertico-map
          ("TAB" . ceamx/vertico-partial-insert)
          ("C-j" . vertico-insert)))
#+end_src

Fine-tune Vertico appearance per-command or per-category with
~vertico-multiform~:

#+begin_src emacs-lisp
(after! vertico
  ;; NOTE: Takes precedence over `vertico-multiform-categories'.
  (setopt vertico-multiform-commands
          `((consult-line buffer)
           (consult-imenu buffer)
           (consult-org-heading ,(lambda (_) (text-scale-set -1)))))

  (setopt vertico-multiform-categories
          '((buffer flat (vertico-cycle . t))
            (consult-grep buffer)
            (imenu (:not indexed mouse))
            (symbol (vertico-sort-function . vertico-sort-alpha))))

  (vertico-multiform-mode))

(after! vertico-multiform
  (keymap-set vertico-multiform-map "C-l" #'vertico-multiform-vertical))
#+end_src

**** =marginalia= :: minibuffer completion annotations

+ Package :: <https://github.com/minad/marginalia>

#+begin_src emacs-lisp
(package! marginalia
  (keymap-set minibuffer-local-map "M-a" #'marginalia-cycle)

  (marginalia-mode 1))

(after! marginalia
  (setopt marginalia-align 'right
          marginalia-align-offset 0))
#+end_src

**** =nerd-icons-completion= :: icons for minibuffer completions :icons:

#+begin_src emacs-lisp
(package! nerd-icons-completion
  (after! marginalia
    (nerd-icons-completion-mode)
    (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup)))
#+end_src

**** =consult= :: [consult]ing ~completing-read~
:PROPERTIES:
:ID:       2eff5461-19e2-49a8-9c43-17b2dd6d76f7
:END:

- website :: <https://github.com/minad/consult>
- ref :: <https://www.gnu.org/software/emacs/manual/html_node/elisp/Minibuffer-Completion.html>

#+begin_src emacs-lisp
(package! consult
  (keymap-global-set "C-c B" #'consult-bookmark)
  (keymap-global-set "C-c h" #'consult-history)
  (keymap-global-set "C-c k" #'consult-kmacro)
  (keymap-global-set "C-c q a t" #'consult-theme)

  ;; Improve previews for `consult-register' and other register commands
  (setopt register-preview-delay 0.5)
  (setopt register-preview-function #'consult-register-format)
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Display xref locations with previews
  (setopt xref-show-definitions-function #'consult-xref)
  (setopt xref-show-xrefs-function #'consult-xref))

(after! consult
  (require 'consult-imenu)

  (setopt consult-narrow-key "<")       ; alternative: "C-+"
  (setopt consult-line-numbers-widen t)
  (setopt consult-async-min-input 3
          consult-async-input-debounce 0.5
          consult-async-input-throttle 0.8)

  (after! pulsar
    (setq consult-after-jump-hook nil)
    (dolist (fn '(pulsar-recenter-top pulsar-reveal-entry))
      (add-hook 'consult-after-jump-hook fn))))
#+end_src

Refine preview appearance and behavior:

#+begin_src emacs-lisp
(after! consult
  (setopt consult-preview-key 'any)

  (consult-customize
   consult-theme :preview-key '(:debounce 0.2 any)

   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file
   ;; :preview-key (kbd "M-.")
   :preview-key '(:debounce 0.4 any)))
#+end_src

