lisp/ceamx-init-search.el
;; :ID:       184ea61e-d07b-4af9-bb49-bcd539b38268
;; :END:


(defvar xref-ignored-files nil
  "List of files to be ignored by `xref'.")

(keymap-set ceamx-code-prefix "d" #'xref-find-definitions)

(after! xref
  (setopt xref-file-name-display 'project-relative)
  (setopt xref-prompt-for-identifier nil)
  (setopt xref-show-definitions-function #'xref-show-definitions-completing-read)
  (setopt xref-show-xrefs-function #'xref-show-definitions-buffer))

;; Provide the ~ceamx-init-search~ feature


(provide 'ceamx-init-search)
;;; ceamx-init-search.el ends here
