config.org
**** =popper= :: Summon and dismiss "popup" windows :popup:
:PROPERTIES:
:ID:       22ada524-f8e6-4f97-b745-5e00219c1be4
:END:

- Website :: <https://github.com/karthink/popper>

#+begin_src emacs-lisp
(package! popper
  (define-keymap :keymap (current-global-map)
    "C-`" #'popper-toggle
    "C-~" #'popper-cycle
    "C-M-`" #'popper-toggle-type)

  (setopt popper-reference-buffers
          (append
           ceamx-simple-help-modes-list
           ceamx-simple-help-buffer-names-list
           ceamx-simple-manual-modes-list
           ceamx-simple-repl-modes-list
           ceamx-simple-repl-buffer-names-list
           ceamx-simple-grep-modes-list
           '(+popper-current-buffer-popup-p)
           '(;; Custom-mode
             compilation-mode
             epa-info-mode
             messages-buffer-mode)
           (list
            ceamx-simple-checkers-buffer-names-regexp)

           `(,(rx "Output*" eol)
             ,(rx "*" (or
                       "Async-native-compile-log"
                       "Backtrace"
                       "Compile-Log"
                       "Completions"
                       "compilation"
                       "elpaca-diff"
                       "Error"
                       "Messages"
                       "Shell Command Output"
                       "vc"
                       "Warnings")
               "*")
             "^\\*Embark Export"
             "^Calc:"
             "\\*Async Shell Command\\*"
             ;; ("\\*Async Shell Command\\*" . hide)
             ("\\*Detached Shell Command\\*" . hide))))

  ;; Load as early as possible to catch popups as early as possible.
  (popper-mode)
  (popper-echo-mode))
#+end_src

***** Configure overrides in ~popper-repeat-map~

#+begin_src emacs-lisp
(after! popper
  (defvar-keymap popper-repeat-map
    :repeat t
    "`" #'popper-cycle
    "~" #'popper-cycle-backwards))
#+end_src

***** DISABLED Configure popup display control rules manually
:PROPERTIES:
:header-args: :tangle no
:END:

<https://github.com/karthink/popper/blob/master/README.org#popup-placement-controlled-using-display-buffer-alist-or-shackleel>

#+begin_src emacs-lisp
(after! popper
  (setopt popper-display-control nil)

  (prependopt! display-buffer-alist
               '((popper-display-control-p
                  (ceamx-window-display-popup)
                  (window-height . ,popper-window-height)))))
#+end_src

**** =lentic= :: Create decoupled views of the same content

#+begin_src emacs-lisp
(package! lentic
  (global-lentic-mode))

(with-eval-after-load 'lentic
  (add-to-list 'safe-local-variable-values '(lentic-init . lentic-orgel-org-init)))
#+end_src

*** =breadcrumb= :: header-line wayfinding :headerline:

- Package :: <https://github.com/joaotavora/breadcrumb>

#+begin_src emacs-lisp
(package! breadcrumb
  (add-hook 'ceamx-after-init-hook #'breadcrumb-mode))
#+end_src

*** Interactive window management
**** Restore previous window configurations with the ~winner-mode~ feature :history:

#+begin_src emacs-lisp
(add-hook 'ceamx-after-init-hook #'winner-mode)
#+end_src

**** =golden-ratio= :: automatically resize windows according to Ancient Wisdom :package:

#+begin_src emacs-lisp
(package! golden-ratio
  (setopt golden-ratio-auto-scale t)
  (setopt golden-ratio-max-width 100))
#+end_src

**** =ace-window= :: interactively manage windows
:PROPERTIES:
:ID:       f582eb53-4eb6-4bfd-a67d-feb2facfd23e
:END:

<https://github.com/abo-abo/ace-window>

#+begin_src emacs-lisp
(package! ace-window
  (define-keymap :keymap (current-global-map)
    "C-x O" #'ace-window))

(after! ace-window
  (setopt aw-scope 'visible))
#+end_src

**** =transpose-frame= :: transpose a frame's windows
:PROPERTIES:
:ID:       76f64487-fbd0-4754-af9b-ceebf4f0916e
:END:

#+begin_src emacs-lisp
(package! transpose-frame
  (keymap-global-set "C-x w SPC" #'transpose-frame))
#+end_src

**** ~ceamx/window-dispatch~: a window-management menu :transient:menu:keybinds:

#+begin_src emacs-lisp
(transient-define-prefix ceamx/window-dispatch ()
  "Window management transient."
  :transient-suffix 'transient--do-stay
  [["Move"
    ("h" "left" windmove-left)
    ("j" "down" windmove-down)
    ("k" "up" windmove-up )
    ("l" "right" windmove-right)
    ("w" "sel" ace-window)]

   ["Resize"
    ("=" "bal" balance-windows)
    ("+" "bal: area" balance-windows-area)
    ("-" "fit: buffer" fit-window-to-buffer)]

   ["Buffer"
    ("b" "buf" consult-buffer)
    ;; ("f" "ff: p" project-find-file)
    ("f" "file" find-file )
    ("F" "file" find-file-other-window)
    ("g" "grep" consult-ripgrep)]

   ["Swarp"
    ("H" "left" ceamx/window-move-left)
    ("J" "down" ceamx/window-move-down)
    ("K" "up" ceamx/window-move-up)
    ("L" "right" ceamx/window-move-right)
    ""
    ("s" "swap" ace-swap-window)
    ("2" "spl: dn" split-window-below)
    ("3" "spl: rt" split-window-right)
    ("SPC" "swap-or-rotate" ceamx/swap-or-rotate-windows)]

   ["Scroll"
    ;; TODO: allow selecting a window (with infix?) to act upon
    ;; NOTE: These are the correct scroll direction commands, which might
    ;; appear to be reversed when comparing with labels.
    ("." "left" scroll-right)
    ("," "right" scroll-left)
    ("SPC" "down" scroll-up)
    ("DEL" "up" scroll-down)]

   ["Lifecycle"
    ("d" "del (this)" delete-window)
    ("D" "del (select)" ace-delete-window)
    ;; ("D" "del: o" delete-other-windows :transient nil)
    ("u" "undo" winner-undo)
    ("U" "redo" winner-redo)
    ""
    ("0" "del" delete-window)
    ("1" "del other" delete-other-windows)
    ""
    ("S" "[ ] sides" window-toggle-side-windows)
    ("`" "[ ] popups" popper-toggle)
    ""
    ("q" "quit" transient-quit-all)]])
#+end_src

*** Workspace Isolation :workspace:

#+begin_src emacs-lisp
(use-feature! ceamx-window
  :demand t
  :config
  (setopt ceamx-window-workspace-provider 'activities))
#+end_src

**** =activites= :: organize window+buffer by activity :tabs:
:PROPERTIES:
:ID:       91310539-1562-4d0c-9648-0f3aa56cc2f0
:END:

- Website :: <https://github.com/alphapapa/activities.el>

#+begin_src emacs-lisp
(package! activities
  (activities-mode 1)
  (activities-tabs-mode 1)

  ;; Synchronize with future `tab-bar-mode' state changes.
  (add-hook 'tab-bar-mode-hook #'activities-tabs-mode)

  (setopt edebug-inhibit-emacs-lisp-mode-bindings t))

(after! activities
  (setopt activities-name-prefix "α ")
  ;; Don't interfere with the bookmark system.
  (setopt activities-bookmark-store nil)
  ;; Kill buffers upon invocation of `activities-suspend'.
  (setopt activities-kill-buffers t))
#+end_src

The keybindings conflict with ~edebug~, so they need to be defined later
than usual.  This is still the case as of [2025-01-25 Sat].

#+begin_src emacs-lisp
(defun ceamx-after-init-define-activities-keys-h ()
  "Define keybindings for `activities' late to override `edebug'.
Intended for use as a hook on `ceamx-after-init-hook'."
  (setq edebug-inhibit-emacs-lisp-mode-bindings t)

  ;; (keymap-global-unset "C-x C-a" t)
  (keymap-global-set "C-x C-a" (cons "Activities" (define-prefix-command 'ceamx-activities-prefix)))

  ;; TODO: still shares bindings with edebug which is confusing
  (define-keymap :keymap (current-global-map)
    "C-x C-a C-n" #'activities-new
    "C-x C-a C-d" #'activities-define
    "C-x C-a C-a" #'activities-resume
    "C-x C-a C-s" #'activities-suspend
    "C-x C-a C-k" #'activities-kill
    "C-x C-a RET" #'activities-switch

    "C-x C-a b" #'activities-switch-buffer
    "C-x C-a g" #'activities-revert
    "C-x C-a l" #'activities-list))

(add-hook 'ceamx-after-init-hook #'ceamx-after-init-define-activities-keys-h)
#+end_src

**** =bufler= :: group buffers with programmable rules
:PROPERTIES:
:ID:       82ed50ad-45b4-4a0c-9ae5-e978de65cdcd
:END:

#+begin_src emacs-lisp
(package! bufler
  (require 'bufler)

  (define-keymap :keymap (current-global-map)
    ;; "C-x b" #'bufler-switch-buffer
    "C-x B" #'bufler-workspace-focus-buffer
    "C-x C-b" #'bufler                  ; orig. `ibuffer'
    "C-x C-B" #'ibuffer

    "C-x w o" #'bufler-workspace-open
    "C-x w r" #'bufler-workspace-reset
    "C-x w s" #'bufler-workspace-save ; orig. `window-toggle-side-windows'
    )

  (define-keymap :keymap ceamx-workspace-prefix-map
    "TAB" #'bufler-workspace-open
    "b" #'bufler-workspace-switch-buffer
    "B" #'bufler-workspace-focus-buffer
    "r" #'bufler-workspace-reset
    "s" #'bufler-workspace-save))
#+end_src

Here are the customizations for Bufler:

#+begin_src emacs-lisp
(after! bufler
  (setopt bufler-reverse t)
  (setopt bufler-workspace-mode-lighter "β ")
  (setopt bufler-columns '("Name" "Size" "Mode" "VC" "Path"))
  (setopt bufler-initial-face-depth 1)
  (after! prism
    (setopt bufler-face-prefix "prism-level-")))
#+end_src

Here are the definitions for the Bufler grouping rules:

#+begin_src emacs-lisp
(after! bufler
  ;; XXX: This absolutely MUST NOT use `setopt'!  Otherwise, the
  ;; package will fail to load due to a hard-to-trace error saying
  ;; something about nil being a void-function.  This probably has
  ;; something to do with the `setopt' type-checking.
  (setq bufler-groups
        (bufler-defgroups
          (group
           ;; Subgroup collecting all named workspaces.
           (auto-workspace))

          (group (mode-match "Ement" (rx bos "ement-")))
          (group (group-or "Elfeed"
                           (mode-match "*Elfeed*" (rx bos "elfeed-"))
                           (name-match "elfeed config" (rx bos "elfeed." (or "el" "org")))))

          ;;
          ;; Help / info / manuals
          (group
           (group-or "*Help/Info*"
                     (mode-match "*Help*" (rx bos "help-"))
                     (mode-match "*Info*" (rx bos "info-"))))

          ;;
          ;; Special buffers
          (group
           ;; Subgroup collecting all special buffers (i.e. ones that are
           ;; not file-backed), except `magit-status-mode' buffers (which
           ;; are allowed to fall through to other groups, so they end up
           ;; grouped with their project buffers).
           (group-not "*Special*"
                      (group-or "*Special*"
                                (mode-match "Magit" (rx bos "magit-status"))
                                (mode-match "Forge" (rx bos "forge-"))
                                (mode-match "Org" (rx bos "org-"))
                                (auto-file)
                                (mode-match "Dired" (rx bos "dired"))))
           (group
            ;; Subgroup collecting these "special special" buffers
            ;; separately for convenience.
            (name-match "**Special**"
                        (rx bos "*" (or "Messages" "Warnings" "scratch" "Backtrace") "*")))
           (group
            ;; Subgroup collecting all other Magit buffers, grouped by
            ;; directory.
            (mode-match "*Magit* (non-status)"
                        (rx bos (or "magit" "forge") "-"))
            (auto-directory))
           (auto-mode))

          ;;
          ;; Ceamx
          (group
           (dir user-emacs-directory)
           (auto-parent-project))

          ;;
          ;; Jobwork
          (group
           ;; TODO: make ~/Projects/work a variable `ceamx-jobwork-dir'
           (dir (list (file-name-concat ceamx-projects-dir "work")
                      ;; TODO: make ~/Documents a variable `ceamx-documents-dir'
                      (file-name-concat (alist-get "DOCUMENTS" xdg-user-dirs) "work")))
           (dir '("~/Projects/work/applications") 1)
           (dir ceamx-note-work-dir)
           (group (auto-indirect))
           (auto-parent-project))

          ;;
          ;; Org and notes
          ;; TODO: group journal dir separately for isolation
          (group
           (dir ceamx-agenda-dir)
           (dir ceamx-note-default-dir)
           (dir ceamx-note-journal-dir)
           (group
            ;; Subgroup collecting indirect Org buffers, grouping them by
            ;; file.  This is very useful when used with
            ;; `org-tree-to-indirect-buffer'.
            (auto-indirect)
            (auto-file))
           ;; Group remaining buffers by whether they're file backed, then
           ;; by mode.
           (group-not "*special*" (auto-file))
           (auto-mode))

          (group-or "Home"
                    (dir '("/etc/nixos" "~/.config")))

          (group
           (auto-parent-project)
           (auto-indirect))

          (auto-directory)
          (auto-mode))))
#+end_src

**** Switch buffers with scoped buffer lists

#+begin_src emacs-lisp
(use-feature! ceamx-window
  :commands (ceamx/switch-to-buffer)
  :bind
  ("C-x b" . #'ceamx/switch-to-buffer))
#+end_src

*** Provide the ~ceamx-init-window~ feature
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-window.el :comments no
(provide 'ceamx-init-window)
;;; ceamx-init-window.el ends here
#+end_src

** Version Control :vcs:
:PROPERTIES:
:header-args: :tangle lisp/ceamx-init-vcs.el
:VISIBILITY: folded
:END:

*** Requirements
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-vcs.el :comments no
;; -*- lexical-binding: t;  -*-

(require 'ceamx-paths)
(require 'ceamx-lib)
#+end_src

*** Set up ~ediff~

#+begin_src emacs-lisp
(setup ediff
  (:autoload #'ediff-buffers
             #'ediff-files
             #'ediff-buffers3
             #'ediff-files3)
  (setopt ediff-keep-variants nil
          ediff-make-buffers-readonly-at-startup nil
          ediff-merge-revisions-with-ancestor t
          ediff-show-clashes-only t
          ;; Keep the ~ediff~ control panel in the same frame.
          ediff-window-setup-function #'ediff-setup-windows-plain))
#+end_src

*** Set up ~diff-mode~

#+begin_src emacs-lisp
(setup diff-mode
  (setopt diff-default-read-only t)
  (setopt diff-advance-after-apply-hunk t)
  (setopt diff-update-on-the-fly t)
  (setopt diff-refine 'font-lock)
  (setopt diff-font-lock-prettify t
          diff-font-lock-syntax 'hunk-also))
#+end_src

