lisp/ceamx-init-vcs.el
;; -*- lexical-binding: t;  -*-

(require 'ceamx-paths)
(require 'ceamx-lib)

;; Set up ~ediff~


(setup ediff
  (:autoload #'ediff-buffers
             #'ediff-files
             #'ediff-buffers3
             #'ediff-files3)
  (setopt ediff-keep-variants nil
          ediff-make-buffers-readonly-at-startup nil
          ediff-merge-revisions-with-ancestor t
          ediff-show-clashes-only t
          ;; Keep the ~ediff~ control panel in the same frame.
          ediff-window-setup-function #'ediff-setup-windows-plain))

;; Set up ~diff-mode~


(setup diff-mode
  (setopt diff-default-read-only t)
  (setopt diff-advance-after-apply-hunk t)
  (setopt diff-update-on-the-fly t)
  (setopt diff-refine 'font-lock)
  (setopt diff-font-lock-prettify t
          diff-font-lock-syntax 'hunk-also))
