config.org
*** Set up GitHub token authentication :secrets:

- Docs :: <https://magit.vc/manual/ghub.html#Creating-and-Storing-a-Token>
- Docs :: <https://magit.vc/manual/forge.html#Token-Creation>
- Docs :: [[info:auth#The Unix password store][info "(auth) The Unix password store"]]

Create the token at https://github.com/settings/tokens/new with these scopes:

+ =repo=  grants full read/write access to private and public repositories.
+ =user=  grants access to profile information.
+ =read:org=  grants read-only access to organization membership.

Add the token to the password store:

  #+begin_src shell :tangle no
pass insert api.github.com/montchr^forge
#+end_src

Note that =^forge= is required by the =ghub= backend to denote the package using the
stored token:

#+begin_quote
The default Auth-Source backends only support storing three values per entry;
the "machine", the "login" and the "password". Because Ghub uses separate tokens
for each package, it has to squeeze four values into those three slots, and it
does that by using "USERNAME /^PACKAGE/ " as the "login".
#+end_quote

*** Provide the ~ceamx-init-vcs~ feature
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-vcs.el :comments no
(provide 'ceamx-init-vcs)
;;; ceamx-init-vcs.el ends here
#+end_src

** Language Support
:PROPERTIES:
:header-args: :tangle lisp/ceamx-init-langs.el
:VISIBILITY: folded
:END:

*** Requirements
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :comments no
;; -*- lexical-binding: t -*-

(require 'treesit)

(require 'ceamx-lib)
#+end_src

*** Writing modes

**** =typo= :: typographical correctneß

+ Package :: <https://github.com/jorgenschaefer/typoel>

*Before*:	The "quick" brown --- ffiox.
*After*:	The “quick” brown — ffiox.

#+begin_src emacs-lisp
(package! typo
  ;; Provides [C-c 8] prefix for Unicode entry to complement [C-x 8].
  (typo-global-mode 1)

  ;; Cycle through typographical variants of commonly-mistyped
  ;; characters like quotation marks and dashes.
  (add-hook 'text-mode-hook #'typo-mode)

  (keymap-set ceamx-toggle-prefix "t" #'typo-mode))
#+end_src

*** Programming modes

#+begin_src emacs-lisp
(after! prog-mode
  (define-keymap :keymap prog-mode-map
    ;; Move forward out of one sexp level
    "C-M-d" #'up-list))
#+end_src

#+begin_src emacs-lisp
(def-hook! ceamx-init-lang-prog-mode-h ()
  '(prog-mode-hook)
  "Enable load-order-dependent features and defaults for all `prog-mode'-derived major modes.
To ensure a predictable execution order, condition checks on
`boundp'/`fboundp' are preferable to using `after!' or
`with-eval-after-load', as the latter may result in a non-deterministic
execution order."

  ;; `highlight-function-calls-mode' should be enabled after other highlighters
  ;; (e.g. `rainbow-delimiters-mode'), according to its readme.
  (when (fboundp 'highlight-function-calls-mode)
    (highlight-function-calls-mode 1)))
#+end_src

*** Outline modes :org:
:LOGBOOK:
- Refiled on [2025-01-17 Fri 11:44]
:END:

**** General customizations for ~outline-mode~ and ~outline-minor-mode~

Remember that ~org-mode~ is derived from ~outline-mode~.

#+begin_src emacs-lisp
(keymap-global-set "<f9>" #'outline-minor-mode)

(after! outline
  (setopt outline-minor-mode-highlight t)
  (setopt outline-minor-mode-cycle t)
  (setopt outline-minor-mode-use-buttons nil))
#+end_src

**** =outli= :: mode-agnostic comment-based outlines

- Package :: <https://github.com/jdtsmith/outli>

#+begin_src emacs-lisp
(package! (outli :host github :repo "jdtsmith/outli")
  (def-hook! +outli-mode-maybe-enable-h ()
    '(prog-mode-hook text-mode-hook)
    "Enable `outli-mode' conditionally, excluding some modes.
Note that `emacs-lisp-mode' is excluded here due to a conflict with
`lispy-mode'.  `outli-mode' must be loaded after `lispy-mode'."
    (let ((exclude-modes '(emacs-lisp-mode))
          (excludep (lambda (excluded-mode)
                      (eq major-mode excluded-mode))))
      (unless (seq-some excludep exclude-modes)
        (outli-mode)))))

(after! outli
  ;; FIXME: this example from the readme results in errors due to mismatched signature
  ;; (advice-add 'load-theme :after #'outli-reset-all-faces)
  ;; (advice-remove 'load-theme #'outli-reset-all-faces)

  (define-keymap :keymap outli-mode-map
    "C-c C-n" #'outline-next-heading
    "C-c C-p" #'outline-previous-heading
    ;; "C-c C-p" #'outline-back-to-heading
    "C-c M-h" #'outline-promote
    "C-c M-l" #'outline-demote))
#+end_src

**** TODO Expand the existing repeat map for outline navigation

I think this needs to be /contracted/ a bit.  Some of these aren't even real commands.

#+begin_src emacs-lisp
(after! (repeat outline)
  (define-keymap :keymap outline-navigation-repeat-map
    "C-x" #'foldout-exit-fold
    "x" #'foldout-exit-fold
    "C-z" #'foldout-zoom-subtree
    "z" #'foldout-zoom-subtree
    "C-a" #'outline-show-all
    "a" #'outline-show-all
    "C-c" #'outline-hide-entry
    "c" #'outline-hide-entry
    "C-d" #'outline-hide-subtree
    "C-e" #'outline-show-entry
    "e" #'outline-show-entry
    "TAB" #'outline-show-children
    "C-k" #'outline-show-branches
    "k" #'outline-show-branches
    "C-l" #'outline-hide-leaves
    "l" #'outline-hide-leaves
    "RET" #'outline-insert-heading
    "C-o" #'outline-hide-other
    "o" #'outline-hide-other
    "C-q" #'outline-hide-sublevels
    "q" #'outline-hide-sublevels
    "C-s" #'outline-show-subtree
    "s" #'outline-show-subtree
    "C-t" #'outline-hide-body
    "t" #'outline-hide-body
    "@" #'outline-mark-subtree)

  (ceamx-repeatify-keymap 'outline-navigation-repeat-map))
#+end_src

**** TODO A transient menu for outline navigation

#+begin_src emacs-lisp
;; (after! (transient outline)
;;   (transient-define-prefix ceamx/outline-dispatch ()
;;     "Outline navigation transient menu."
;;     [["Navigate"
;;       ("u" "up" outline-up-heading)
;;       ("n" "next" outline-next-visible-heading)
;;       ("p" "prev" outline-previous-visible-heading)
;;       ("f" "forward" outline-forward-same-level)
;;       ("b" "backward" outline-backward-same-level)]]))

;; (after! (hydra outline)
;;   (defhydra ceamx/outline-hydra ( :color red)
;;     "
;; ^Navigate^            ^Subtree^        ^Metadata^
;; ^--------^----------  ^-------^-----  ^---------^--
;; _n_ext visible        _I_: drag up    _t_odo-state
;; _p_revious visible    _J_: promote    _d_eadline
;; _f_orward same level  _K_: drag down  _s_chedule
;; _b_ack same level     _L_: demote
;; _u_p level            _N_: narrow     _xp_: set property
;;                       _W_: widen
;; "))
#+end_src

*** =smart-newline= :: a newline command for programming modes

#+begin_src emacs-lisp
(use-package smart-newline
  ;; :ensure t
  :hook (prog-mode . smart-newline-mode))
#+end_src

*** =dumb-jump= :: multi-lang do-what-i-mean jump-to-definition

- Package :: <https://github.com/jacktasia/dumb-jump>

#+begin_src emacs-lisp
(package! dumb-jump
  ;; Add to end of `xref-backend-functions' as a dumb fallback when
  ;; there are no smart options.
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate 100)

  (after! (hydra)
    ;; via <https://github.com/jacktasia/dumb-jump?tab=readme-ov-file#hydra-for-effieciency>
    (defhydra ceamx/dumb-jump-dispatch (:color blue :columns 3)
      "Jump (dumbly)"
      ("j" dumb-jump-go "Go")
      ("o" dumb-jump-go-other-window "Other window")
      ("e" dumb-jump-go-prefer-external "Go external")
      ("x" dumb-jump-go-prefer-external-other-window "Go external other window")
      ("i" dumb-jump-go-prompt "Prompt")
      ("l" dumb-jump-quick-look "Quick look")
      ("b" dumb-jump-back "Back"))

    (define-keymap :keymap ceamx-code-prefix
      "j" #'ceamx/dumb-jump-dispatch/body)))
#+end_src

*** =rainbow-mode= :: Colorize color names and hexcodes in buffers :theme:

<https://elpa.gnu.org/packages/rainbow-mode.html>

#+begin_src emacs-lisp
(package! rainbow-mode)
#+end_src

*** DISABLED ~prism~: disperse structural forms into depth-based color strata

Not my cup of tee...

#+begin_src emacs-lisp :tangle no
(use-package prism
  ;; :ensure t
  :hook (((lisp-mode emacs-lisp-mode) . prism-mode)
         ((python-mode yaml-mode) . prism-whitespace-mode))
  :config
  (setopt prism-num-faces 16)
  ;; TODO: handle `ef-themes'
  (after! modus-themes
    (prism-set-colors
      :desaturations '(0)               ; do not change
      :lightens '(0)                    ; do not change

      ;; 4-color:
      ;; :colors (modus-themes-with-colors
      ;;           (list blue
      ;;                 magenta
      ;;                 magenta-cooler
      ;;                 green-warmer))

      ;; 8-color:
      ;; :colors (modus-themes-with-colors
      ;;           (list blue
      ;;                 magenta
      ;;                 magenta-cooler
      ;;                 cyan-cooler
      ;;                 fg-main
      ;;                 blue-warmer
      ;;                 red-cooler
      ;;                 cyan))

      ;; 16-color:
      :colors (modus-themes-with-colors
                (list fg-main
                      magenta
                      cyan-cooler
                      magenta-cooler
                      blue
                      magenta-warmer
                      cyan-warmer
                      red-cooler
                      green
                      fg-main
                      cyan
                      yellow
                      blue-warmer
                      red-warmer
                      green-cooler
                      yellow-faint)))))
#+end_src

*** =hl-todo= :: Highlight "TODO" and other codetags in comments and strings

- website :: <https://github.com/tarsius/hl-todo>
- reference :: <https://peps.python.org/pep-0350/#specification>

#+begin_src emacs-lisp
(use-package hl-todo
  ;;:ensure t
  :hook (prog-mode . hl-todo-mode))
#+end_src

*** =devdocs= :: Peruse local ~devdocs~ docsets
:PROPERTIES:
:ID:       9907125e-84b9-420f-8991-c24b33f84161
:END:

- Source code :: <https://github.com/astoff/devdocs.el>

NOTE: Must run ~devdocs-install~ before a docset is available for reference.

#+begin_src emacs-lisp
(use-package devdocs
  ;; :ensure t
  :defer t

  :bind
  (:map help-map
        ("D" . devdocs-lookup))

  :init
  (after! popper
    (add-to-list 'popper-reference-buffers "\\*devdocs\\*"))

  :config
  ;; FIXME: on a stale timer! every week! not every session...
  ;; (devdocs-update-all)

  )
#+end_src

*** =sideline-emoji= :: Display emoji-at-point info in =sideline=

#+begin_src emacs-lisp
(package! (sideline-emoji :host github :repo "emacs-sideline/sideline-emoji")
  (after! sideline
    (appendq! sideline-backends-left '((sideline-emoji . up)))))
#+end_src

*** Display multiple composed messages inside ~eldoc~

#+begin_src emacs-lisp
(setopt eldoc-documentation-function #'eldoc-documentation-compose)
#+end_src

*** Linting files with the builtin ~flymake~ feature

#+begin_src emacs-lisp
(setup flymake
  (:hook-into ceamx-after-init-hook)
  ;; Mirror the [C-c !] Flycheck prefix.
  (:bind "C-c ! l" #'flymake-show-buffer-diagnostics
         "C-c ! n" #'flymake-goto-next-error
         "C-c ! p" #'flymake-goto-previous-error
         "C-c ! c" #'flymake-show-buffer-diagnostics)
  (:when-loaded
    (setopt flymake-fringe-indicator-position 'right-fringe)
    (setopt flymake-no-changes-timeout 1.0)
    (setopt flymake-wrap-around t)))

(package! sideline-flymake
  (after! flymake
    (add-hook 'flymake-mode-hook #'sideline-mode))

  (setopt sideline-flymake-show-checker-name t)
  (setopt sideline-flymake-max-lines 1))
#+end_src

*** ~Linting files with the ~flycheck~ package :lint:
:PROPERTIES:
:ID:       1409960a-0d06-440c-a2d6-d238354079d7
:END:

#+begin_src emacs-lisp
(package! flycheck
  (add-hook 'ceamx-after-init-hook #'global-flycheck-mode))

(package! consult-flycheck
  (keymap-global-set "M-g f" #'consult-flycheck)

  (after! (consult flycheck)
    (require 'consult-flycheck)))

(package! sideline-flycheck
  (after! flycheck
    (add-hook 'flycheck-mode-hook #'sideline-mode)
    (add-hook 'flycheck-mode-hook #'sideline-flycheck-setup))

  (after! sideline
    (appendq! sideline-backends-right '(sideline-flycheck)))

  (setopt sideline-flycheck-show-checker-name t)
  (setopt sideline-flycheck-max-lines 1))

(after! flycheck
  (setopt flycheck-emacs-lisp-load-path 'inherit)
  (setopt flycheck-idle-change-delay 3.0
          flycheck-display-errors-delay 1.5)
  (setopt flycheck-check-syntax-automatically
          '(save idle-change mode-enabled))
  (setopt flycheck-buffer-switch-check-intermediate-buffers nil)

  ;; Disable Flycheck for modes supported by Flymake
  (setq-default flycheck-disabled-checkers
                (append (default-value 'flycheck-disabled-checkers)
                        '(emacs-lisp
                          emacs-lisp-checkdoc
                          emacs-lisp-package
                          sh-shellcheck))))
#+end_src

*** =jinx= :: the enchanted spell checker :nixpkgs:

- Docs :: <https://github.com/minad/jinx/wiki>


Ideally =emacsPackages.jinx= from Nixpkgs would install the required =enchant=
package, as =jinx= depends on the latter.  Unfortunately, as of
<2024-05-24 Fri 15:21>, the autoloads from the Nixpkgs package are not set up
properly, and even after setting up autoloads manually below, dictionaries are
unavailable.  Apparently =aspell= dictionaries are used behind the scenes, but
they are not detected from within emacs.

Despite all that:

#+begin_src shell :noweb-ref nil :tangle no
enchant-lsmod-2 -list-dicts
#+end_src

#+RESULTS:
| en                   | (aspell) |
| en-variant_0         | (aspell) |
| en-variant_1         | (aspell) |
| en-variant_2         | (aspell) |
| en-w_accents         | (aspell) |
| en-wo_accents        | (aspell) |
| en_AU                | (aspell) |
| en_AU-variant_0      | (aspell) |
| en_AU-variant_1      | (aspell) |
| en_AU-w_accents      | (aspell) |
| en_AU-wo_accents     | (aspell) |
| en_CA                | (aspell) |
| en_CA-variant_0      | (aspell) |
| en_CA-variant_1      | (aspell) |
| en_CA-w_accents      | (aspell) |
| en_CA-wo_accents     | (aspell) |
| en_GB                | (aspell) |
| en_GB-ise            | (aspell) |
| en_GB-ise-w_accents  | (aspell) |
| en_GB-ise-wo_accents | (aspell) |
| en_GB-ize            | (aspell) |
| en_GB-ize-w_accents  | (aspell) |
| en_GB-ize-wo_accents | (aspell) |
| en_GB-variant_0      | (aspell) |
| en_GB-variant_1      | (aspell) |
| en_GB-w_accents      | (aspell) |
| en_GB-wo_accents     | (aspell) |
| en_US                | (aspell) |
| en_US-variant_0      | (aspell) |
| en_US-variant_1      | (aspell) |
| en_US-w_accents      | (aspell) |
| en_US-wo_accents     | (aspell) |
| he                   | (hspell) |
| he_IL                | (hspell) |

#+begin_src emacs-lisp
(autoload 'global-jinx-mode "jinx")
(autoload 'jinx-correct "jinx")
(autoload 'jinx-languages "jinx")

(add-hook 'ceamx-emacs-startup-hook #'global-jinx-mode)

(keymap-global-set "M-$" #'jinx-correct)
(keymap-global-set "C-M-$" #'jinx-languages)

(after! jinx
  (setopt jinx-languages "en"))
#+end_src

*** Formatters
:PROPERTIES:
:ID:       16856ced-d5a2-4b4a-9506-67d7c19b43f0
:END:
**** [[https://github.com/purcell/emacs-reformatter][purcell/emacs-reformatter]]: KISS DIY FMT :package:

#+begin_src emacs-lisp
(package! reformatter
  (require 'reformatter))
#+end_src

***** Configure generalized polyglot formatters

****** =biome=

- Docs :: <https://biomejs.dev/guides/integrate-in-editor/>

This should, possibly more ideally, be run as an LSP client, but AFAIK one does
not yet exist for Eglot (only LSP-Mode).

#+begin_src emacs-lisp
(after! reformatter
  (reformatter-define biome-format
    :program "biome"
    :args (list "format" "--stdin-file-path" (buffer-file-name))))
#+end_src

