config.org
*** Navigation & Refiling

#+begin_src emacs-lisp
(defvar ceamx-org-outline-search-max-level 5)

(after! org
  (setopt org-imenu-depth ceamx-org-outline-search-max-level))

(after! org-goto
  (setopt org-goto-interface 'outline-path-completion
          org-goto-max-level ceamx-org-outline-search-max-level))

(after! org-refile
  (setopt org-outline-path-complete-in-steps nil)

  (setopt org-refile-use-outline-path 'file)
  (setopt org-refile-allow-creating-parent-nodes 'confirm)
  (setopt org-refile-use-cache nil)

  (setopt org-refile-targets `((,ceamx-default-todo-file . (:level . 1))
                               ;; (org-agenda-files . (:maxlevel . 1))
                               (nil . (:maxlevel . ,ceamx-org-outline-search-max-level))))

  ;; TODO: how to accept any value of `:maxlevel'?
  (add-to-list 'safe-local-variable-values
      '(org-refile-targets (nil :maxlevel . 4)))
  (add-to-list 'safe-local-variable-values
      '(org-refile-targets (nil :maxlevel . 6))))
#+end_src

*** Customize the ~org-navigation-repeat-map~ :keybinds:
:PROPERTIES:
:ID:       54dac9eb-ec7c-4e08-be8c-200068787fa7
:END:

I find myself accidentally exiting out of this repeat map immediately
because I instinctively want to continue pressing the final key in the
original command that triggered the repeat map.  For example, if I
press [C-c C-n] for ~org-next-visible-heading~, I want to continue
pressing [C-n] to repeat the command.  I thought there was a setting
for this behavior, but neither ~repeat-keep-prefix~ or ~repeat-check-key~
seem to have an effect.

#+begin_src emacs-lisp
(after! org
  (define-keymap :keymap org-navigation-repeat-map
    "C-b" #'org-backward-heading-same-level
    "C-f" #'org-forward-heading-same-level
    "C-n" #'org-next-visible-heading
    "C-p" #'org-previous-visible-heading
    "C-u" #'org-up-heading))
#+end_src

*** Set up Org-Capture
:PROPERTIES:
:ID:       c9f35626-6cec-46eb-a140-50be234d55da
:END:

The ~org-capture-templates~ are defined in the [[id:d7334fe7-a7a2-423e-8e3b-fca7c45af07e][Org-Capture templates]]
section.

*** Archiving

#+begin_src emacs-lisp
(after! org-archive
  (setopt org-archive-save-context-info
          '(time file category todo itags olpath ltags)))
#+end_src

*** TODO Refiling: Append not prepend when working on Ceamx config
*** Agenda
:PROPERTIES:
:ID:       ad92ea31-8411-4ba4-b179-cf66e34a016c
:END:

#+BEGIN_SRC emacs-lisp
(use-feature! org-agenda
  :bind ( ("C-c a" . #'org-agenda)
          :map ceamx-launch-prefix
          ("a" . #'org-agenda))

  :config
  (setopt org-agenda-tags-column 0)
  (setopt org-agenda-block-separator ?─)
  (setopt org-agenda-time-grid
          '((daily today require-timed)
            (800 1000 1200 1400 1600 1800 2000)
            " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄"))
  (setopt org-agenda-current-time-string
          "⭠ now ─────────────────────────────────────────────────"))
#+END_SRC

*** =org-super-agenda= :: enchanted groupings for Org-Agenda
:PROPERTIES:
:ID:       6438e6e9-5052-403d-8c23-a1ee8daf0ec2
:END:

The agenda groups are declared in [[id:815ead58-41ac-406b-b1fe-4d6c4c838617][Thee Something-Doing Flow → Org-Agenda groups]]

#+BEGIN_SRC emacs-lisp
(package! org-super-agenda)
#+END_SRC

*** Literate programming

#+BEGIN_SRC emacs-lisp
(after! org-src
  ;; Changing the indentation of source code is unhelpful and destructive.
  (setopt org-edit-src-content-indentation 0)

  (setopt org-edit-src-persistent-message nil)
  (setopt org-src-ask-before-returning-to-edit-buffer nil)
  (setopt org-src-preserve-indentation t)
  (setopt org-src-tab-acts-natively t)

  ;; TODO: current window when narrow/short frame, but otherwise reorganize-frame is good
  ;; (setopt org-src-window-setup 'other-window)
  (setopt org-src-window-setup 'current-window))

(after! org
  ;; Ensure common languages are loaded.
  (setopt org-babel-load-languages '((emacs-lisp . t)
                                     (shell . t)
                                     (sql . t))))
#+END_SRC

*** Org-Babel: Load other supported languages on-demand during execution

+ source :: <https://github.com/Icy-Thought/emacs.d/blob/e9c75d87bf61c456b26332787cde27bdfc188830/config.org#org-babel-language-on-demand>

#+begin_src emacs-lisp
(after! ob-core
  (def-advice! +org-babel-load-language-on-demand-a (orig-fun &rest args)
    :around #'org-babel-execute-src-block
    "Load language if needed before executing a source block."
    (let ((language (org-element-property :language (org-element-at-point))))
      (unless (cdr (assoc (intern language) org-babel-load-languages))
        (add-to-list 'org-babel-load-languages (cons (intern language) t))
        (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages))
      (apply orig-fun args))))
#+end_src

*** TODO Provide commands to archive DONE tasks
:PROPERTIES:
:ID:       2b459993-8258-4128-adc7-c5025def759c
:END:

| Author | Sacha Chua                                                                                 |
| URL    | <https://pages.sachachua.com/.emacs.d/Sacha.html#quick-way-to-archive-all-done-from-inbox> |

I don't think this is working properly...

#+begin_src emacs-lisp :tangle no
(require 'ceamx-paths)

(defun ceamx/org-clean-up-inbox ()
  "Archive all DONE tasks and sort the remainder by TODO order."
  (interactive)
  (with-current-buffer (find-file ceamx-default-todo-file)
    (ceamx/org-archive-done-tasks 'file)
    (goto-char (point-min))
    (if (org-at-heading-p) (save-excursion (insert "\n")))
    (org-sort-entries nil ?p)
    (goto-char (point-min))
    (org-sort-entries nil ?o)
    (save-buffer)))

(defun ceamx/org-archive-done-tasks (&optional scope)
  "Archive finished or cancelled tasks.
       SCOPE can be 'file or 'tree."
  (interactive)
  (org-map-entries
   (lambda ()
     (org-archive-subtree)
     (setq org-map-continue-from (outline-previous-heading)))
   "TODO=\"DONE\"|TODO=\"CANCELLED\""
   (or scope (if (org-before-first-heading-p) 'file 'tree))))
#+end_src

*** =org-download= :: support dragging-and-dropping images into Org buffers :media:network:package:

<https://github.com/abo-abo/org-download>

#+BEGIN_SRC emacs-lisp
(package! org-download
  (require 'org-download)
  (add-hook 'dired-mode-hook #'org-download-enable))
#+END_SRC

*** =org-web-tools= :: view, capture, and archive webpages in org-mode :package:network:web:
:PROPERTIES:
:ID:       17850df6-1729-4b2b-8fc5-62f4b377c2a7
:END:

#+BEGIN_SRC emacs-lisp
(package! org-web-tools
  (keymap-set org-mode-map "C-c i l" #'org-web-tools-insert-link-for-url))
#+END_SRC

*** =org-sidebar= :: provide a sidebar for Org buffers :package:

<https://github.com/alphapapa/org-sidebar>

#+BEGIN_SRC emacs-lisp
(package! org-sidebar)
#+END_SRC

*** =org-bookmark-heading= :: Support heading bookmarks :bookmarks:package:
:PROPERTIES:
:ID:       cd3ef5ab-e573-43e9-b1f7-81eb6dade0a9
:END:

#+begin_src emacs-lisp
(package! org-bookmark-heading
  (after! org
    (require 'org-bookmark-heading)))

(after! org-bookmark-heading
  (setopt org-bookmark-heading-make-ids t
          org-bookmark-heading-jump-indirect nil))
#+end_src

*** =org-remark= :: annotate documents with Org-Mode

#+begin_src emacs-lisp
(package! org-remark)
#+end_src

*** Exporters
**** =ox-gfm= :: org-export to GitHub Flavored Markdown (GFM) :package:
:PROPERTIES:
:ID:       e6aaf439-cfd5-4ed7-8d54-23aaec181b6f
:END:

#+begin_src emacs-lisp
(package! ox-gfm
  (after! org
    (require 'ox-gfm))

  (add-to-list 'safe-local-variable-values
      '(eval add-hook 'after-save-hook #'org-gfm-export-to-markdown t t)))
#+end_src

*** =auto-tangle-mode= :: a minor-mode to automatically tangle Org files
:PROPERTIES:
:ID:       b4f86eda-af4d-405c-bbe1-395fd6f14ddf
:END:

#+BEGIN_SRC emacs-lisp
(package! (auto-tangle-mode
           :host github
           :repo "progfolio/auto-tangle-mode.el"))
#+END_SRC

*** TODO Org-Mode: electric-pair for equals-sign and tilde
*** Footer: Provide the =ceamx-init-org= feature

#+begin_src emacs-lisp :tangle lisp/ceamx-init-org.el :comments no
(provide 'ceamx-init-org)
;;; ceamx-init-org.el ends here
#+end_src

** TODO Printing
:PROPERTIES:
:VISIBILITY: folded
:ID:       22d5396b-cd38-47c0-b299-d7d560d052b7
:header-args:emacs-lisp: :tangle lisp/ceamx-init-printing.el
:END:

Printing is very broken right now and I haven’t tried in a while.

#+begin_src emacs-lisp :tangle lisp/ceamx-init-printing.el :comments no
;; -*- lexical-binding: t; -*-

(require 'ceamx-lib)

(use-feature! printing
  :defer 10
  :commands (pr-update-menus)
  :config
  ;; EPSON WF-3520
  (setopt printer-name "LABORTTY")
  ;; (setopt lpr-switches '())
  (pr-update-menus))

(provide 'ceamx-init-printing)
;;; ceamx-init-printing.el ends here
#+end_src

** Newsreader
:PROPERTIES:
:VISIBILITY: folded
:ID:       c2cb4b34-da9c-42d7-b603-92ef6a0121f7
:header-args:emacs-lisp: :tangle lisp/ceamx-init-news.el
:END:

*** Requirements
:PROPERTIES:
:VISIBILITY: folded
:ID:       f2baf249-16c1-408e-a07a-a6a1e7be7ece
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-news.el :comments no
;;  -*- lexical-binding: t; -*-

(require 'ceamx-paths)
#+end_src

*** =elfeed= :: an improved feed reader
:PROPERTIES:
:ID:       eb9bac6b-bcc1-4eba-a921-adaf4a93273b
:END:

Filter prefixes:

+ =+= :: AND Tag
+ =-= :: NOT Tag
+ =@= :: Age or date range.  Accepts plain English separated by dashes.
  Note that age filters improve performance of database lookups.
  + Examples
    + =@2-years-old= :: Filter items older than 2 years ago e.g. if 2025
      now, then items from 2023 or later.
    + =@2-weeks-ago= :: Filter items older than 2 weeks
    + =@2025-01-01= :: Filter items older than date
    + =@5-days-ago--1-day-ago= :: Filter items not in range, where range
      is indicated by double-dashes
+ =!= :: Filter out items matching regular expression.
+ === :: Include only items whose feed title or URL match regular
  expression.  Results will match =ANY= such component.
+ =~= :: Exclude items whose feed title or URL match regular expression
  (reverse of === prefix).  Results will match =ANY= such component.
+ =#= :: Limit to number of items following prefix
+ All other components are treated as a regular expression for feed
  title or URL.  Results will match =ALL= such components.

Examples:

+ =@6-months-ago +unread= :: Only show unread entries from the past six
  months.  This is the default filter.
+ =linu[xs] @1-year-old= :: Only show entries about Linux or some person
  whose name is Linus from the past year.
+ =-unread +video +music #10= :: Only show 10 of the most recent and
  previously-read entries tagged with =video= and =music=.
+ =+emacs =https://youtube.com= :: Only show entries from YouTube tagged as =emacs=

The feed list is set up with =elfeed-org= and should live at
=~/Documents/reading/feeds/index.org=.

#+begin_src emacs-lisp
(package! elfeed
  (keymap-set ceamx-launch-prefix "f" #'elfeed)

  (after! elfeed
    (require 'ceamx-news)

    (make-directory elfeed-db-directory t)

    (setopt elfeed-search-filter "@1-week-ago +unread")
    (setopt elfeed-show-entry-switch #'pop-to-buffer
            elfeed-show-entry-delete #'ceamx-news/delete-pane))

  (after! popper
    (add-to-list 'popper-reference-buffers "^\\*elfeed-entry")))

(package! elfeed-goodies
  (after! elfeed
    (require 'elfeed-goodies)
    (elfeed-goodies/setup))
  ;; (after! elfeed-goodies
  ;;   )
  )
#+end_src

*** =elfeed-org= :: organize =elfeed= subscriptions via Org-Mode
:PROPERTIES:
:ID:       5d6d2565-5591-40f9-bd2b-6d5493dae613
:END:

#+begin_src emacs-lisp
(package! elfeed-org
  ;; HACK: Must be set prior to feature load.
  ;; <https://github.com/doomemacs/doomemacs/blob/2bc052425ca45a41532be0648ebd976d1bd2e6c1/modules/app/rss/config.el#L74-L75>
  (setq rmh-elfeed-org-files
        (list (file-name-concat ceamx-reading-feed-dir "index.org")))

  (after! elfeed
    (require 'elfeed-org)
    (elfeed-org)))
#+end_src

*** =elfeed-tube= :: enhance the =elfeed= video experience
:PROPERTIES:
:ID:       d8d28c05-a2b3-42a0-96cd-84400584b4eb
:END:

#+begin_src emacs-lisp
(package! elfeed-tube
  (after! elfeed
    (require 'elfeed-tube)
    (keymap-set elfeed-show-mode-map "F" #'elfeed-tube-fetch)
    (keymap-set elfeed-show-mode-map "<remap> <save-buffer>" #'elfeed-tube-save)
    (keymap-set elfeed-search-mode-map "F" #'elfeed-tube-fetch)
    (keymap-set elfeed-search-mode-map "<remap> <save-buffer>" #'elfeed-tube-save))
  (after! elfeed-tube
    (setopt elfeed-tube-auto-save-p nil
            elfeed-tube-auto-fetch-p t)
    (elfeed-tube-setup)))

(package! elfeed-tube-mpv
  (after! elfeed
    (keymap-set elfeed-show-mode-map "C-c C-f" #'elfeed-tube-mpv-follow-mode)
    (keymap-set elfeed-show-mode-map "C-c C-w" #'elfeed-tube-mpv-where)))
#+end_src

*** =elfeed-score= :: provide Gnus-style scoring for =elfeed=
:PROPERTIES:
:ID:       f1a262e4-0274-4f5a-b8b5-f8952d7523ab
:END:

I wonder if there is a way to export NewsBlur scoring to this format…

#+begin_src emacs-lisp
(package! elfeed-score
  (after! elfeed
    (elfeed-score-enable))
  (after! elfeed-score
    ;; <https://www.unwoundstack.com/doc/elfeed-score/curr>
    (setopt elfeed-score-serde-score-file
            (file-name-concat ceamx-reading-feed-dir "elfeed-scores.eld")))
  (after! (elfeed elfeed-score)
    (keymap-set elfeed-search-mode-map "=" elfeed-score-map)))
#+end_src

*** Provide the ~ceamx-init-news~ feature
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-news.el :comments no
(provide 'ceamx-init-news)
;;; ceamx-init-news.el ends here
#+end_src

** TODO Mail
:PROPERTIES:
:ID:       393bf925-aa13-4076-a3e9-dff923664711
:END:

** Web Browsing :web:
:PROPERTIES:
:VISIBILITY: folded
:ID:       bbd80e03-694c-4f5b-ab31-336fd2afd963
:header-args:emacs-lisp: :tangle lisp/ceamx-init-eww.el
:END:

