config.org
*** Requirements
:PROPERTIES:
:VISIBILITY: folded
:ID:       c5bfe32a-b89a-492a-bc83-e61f6cb6a23d
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-eww.el :comments no
;; -*- lexical-binding: t; -*-

(require 'ceamx-lib)
#+end_src

*** Tell Emacs we want its Web Wowser to handle URL browsing by default
:PROPERTIES:
:ID:       e9e1a28b-8fee-4dfd-83ad-52421155f652
:END:

#+begin_src emacs-lisp
(setopt browse-url-browser-function 'eww-browse-url)
#+end_src

*** TODO Use a different browser for some domains
*** Configure EWW
:PROPERTIES:
:ID:       15ef1788-7ded-42e9-8109-019b4e6bb03b
:END:

#+begin_src emacs-lisp
(setopt shr-use-colors t)
(setopt shr-folding-mode t)
(setopt shr-bullet "• ")

(setopt eww-search-prefix "https://duckduckgo.com/html?q=")

;; HTTP headers may contain user information, which we can limit as needed.
;; When providing a list of symbols, the symbols indicate what NOT to send.
;; TODO: Move this elsewhere, as it probably affects other HTTP requests.
(setopt url-privacy-level '(email lastloc))

(keymap-set ceamx-launch-prefix "b" #'eww)
(keymap-set ceamx-launch-prefix "W" #'ceamx/eww-wiki)

(after! eww
  (define-keymap :keymap eww-mode-map
    "," '("scroll down" . scroll-up-command)
    "." '("scroll up" . scroll-down-command)
    "o" '("open link" . link-hint-open-link)))
#+end_src

*** Cleanup the rendering of some pages
:PROPERTIES:
:ID:       2fa70c64-7584-4a88-8a74-b3345bb3de3d
:END:

#+begin_src emacs-lisp
(use-feature! ceamx-eww
  :after eww
  :functions (ceamx-eww-rerender)
  :init
  (add-hook 'eww-after-render-hook #'ceamx-eww-rerender))
#+end_src

*** Provide the ~ceamx-init-eww~ feature
:PROPERTIES:
:ID:       5632344a-8c09-47e7-960d-92fdf3bbd64b
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-eww.el :comments no
(provide 'ceamx-init-eww)
;;; ceamx-init-eww.el ends here
#+end_src

** Tools
:PROPERTIES:
:header-args: :tangle lisp/ceamx-init-tools.el
:VISIBILITY: folded
:ID:       4b709806-6aa9-4191-a7c7-db7fe79c2ed3
:END:

*** Requirements
:PROPERTIES:
:VISIBILITY: folded
:ID:       709b1092-1de6-43f6-bbb9-3aa15b496f49
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-tools.el :comments no
;; -*- lexical-binding: t;  -*-

(require 'ceamx-lib)
(require 'seq)
#+end_src

*** Set up ~eshell~, the Emacs-Lisp shell

#+begin_src emacs-lisp
(after! eshell
  (setopt eshell-scroll-to-bottom-on-input 'this))
#+end_src

*** =eat= :: [E]mulate [A] [T]erminal
:PROPERTIES:
:ID:       cafaa1b0-d633-4e7e-b470-6dbfd534c35f
:END:

+ Package :: <https://codeberg.org/akib/emacs-eat/>

  #+begin_src emacs-lisp
(package! eat
  (keymap-set ceamx-launch-prefix "t" #'eat)

  (after! eshell
    (add-hook 'eshell-load-hook #'eat-eshell-mode)
    (add-hook 'eshell-load-hook #'eat-eshell-visual-command-mode))
  (after! popper
    (setopt popper-reference-buffers
            (append popper-reference-buffers '("\\*eat\\*")))))
#+end_src

*** [[https://joostkremers.github.io/pandoc-mode/][Pandoc-mode]]: filetype conversion multitool

#+begin_src emacs-lisp
(package! pandoc-mode
  (add-hook 'markdown-mode-hook #'pandoc-mode)

  (add-hook 'pandoc-mode-hook #'pandoc-load-default-settings))
#+end_src

*** =verb= :: organize and send http requests

+ Package :: https://github.com/federicotdn/verb

#+begin_src emacs-lisp
(package! verb
  (after! org
    ;; FIXME: is there a better way to bind `verb-command-map', the
    ;; primary entrypoint?
    ;; (defer! 2
    ;;   (require 'verb))
    (keymap-set org-mode-map "C-c C-r" verb-command-map) ; orig. `org-fold-reveal'
    ))
#+end_src

*** [[https://github.com/hniksic/emacs-htmlize][hniksic/emacs-htmlize]]: Convert buffer text and decorations to HTML

#+begin_src emacs-lisp
(package! htmlize
  ;; FIXME: conflicts with `beframe'
  ;; (keymap-global-set "C-c b h" #'htmlize-buffer)
  )
#+end_src
*** [[https://github.com/alphapapa/unpackaged.el][alphapapa/unpackaged.el]]: a library of useful yet "unsubstantial" Emacs Lisp code

#+begin_src emacs-lisp
(package! (unpackaged :host github :repo "alphapapa/unpackaged.el"))
#+end_src

*** =mugur=: a configurator for QMK keyboards

#+begin_src emacs-lisp
(package! mugur)
#+end_src

*** =free-keys=: Show free keybindings for modkeys or prefixes

+ Package :: <https://github.com/Fuco1/free-keys>

#+begin_src emacs-lisp
(package! free-keys)
#+end_src

*** =help-find= :: introspect keybindings

#+begin_src emacs-lisp
(package! help-find
  (define-keymap :keymap help-map
    "K b" #'help-find-keybinding
    "K f" #'help-find-function))
#+end_src

*** =uuidgen=: Generate and insert UUIDs
:PROPERTIES:
:ID:       48fbfb99-55c9-44db-a342-2c9fe847e85e
:END:

#+begin_src emacs-lisp
(package! uuidgen
  (define-keymap :keymap ceamx-insert-prefix
    "U" (cons "uuid" (define-prefix-command 'ceamx-insert-uuid-prefix))
    "U 1" #'uuidgen-1
    "U 3" #'uuidgen-3
    "U 4" #'uuidgen-4
    "U 5" #'uuidgen-5))
#+end_src

*** Augementated Intelligentry (AI)

Providing integrations with LLMs and other simulation machines.

M is not eager to board the train bound for Hype City.

*** Personal Finance with =hledger=

- Website :: <https://hledger.org/>
- Docs :: <https://hledger.org/1.30/hledger.html#journal>
- Package :: <https://github.com/narendraj9/hledger-mode>

**** Define important feature paths :paths:
:PROPERTIES:
:ID:       6af77ff1-5d06-41c8-bedf-f123ae532989
:END:

#+begin_src emacs-lisp
(defconst ceamx-ledger-dir (expand-file-name "~/ledger"))
(defconst ceamx-ledger-main-journal-file (file-name-concat ceamx-ledger-dir "main.journal"))
#+end_src

**** Install ~hledger-mode~ :package:

#+begin_src emacs-lisp
(require 'ceamx-paths)

(package! hledger-mode
  (setopt hledger-jfile ceamx-ledger-main-journal-file))
#+end_src

**** Register ~hledger-mode~ buffers as popups :window:

#+begin_src emacs-lisp
(after! popper
  (add-to-list 'popper-reference-buffers "\\*Personal Finance\\*"))
#+end_src

**** Register the =hledger= checker for =Flycheck= :checkers:

#+begin_src emacs-lisp
(package! flycheck-hledger
  (when (fboundp 'flycheck-mode)
    (add-hook 'hledger-mode-hook #'flycheck-mode))

  (setopt flycheck-hledger-strict t))
#+end_src

*** PDF-Tools

- website :: <https://github.com/vedang/pdf-tools>
- ref :: <https://github.com/jwiegley/dot-emacs/blob/master/init.org>

~pdf-tools~ should be installed installed via Nixpkgs because it requires
some separate binaries.

#+begin_src emacs-lisp
(require 'ceamx-lib)

(defvar pdf-tools-handle-upgrades nil)

(after! pdf-tools
  (dolist
      (pkg
       '(pdf-annot pdf-cache pdf-dev pdf-history pdf-info pdf-isearch
         pdf-links pdf-misc pdf-occur pdf-outline pdf-sync
         pdf-util pdf-view pdf-virtual))
    (require pkg))
  (pdf-tools-install))
#+end_src

*** TODO <https://github.com/doomemacs/doomemacs/blob/master/modules/tools/pdf/config.el>
*** TODO =saveplace-pdf-view=
*** =ready-player= :: multimedia file previews :nixpkgs:

+ Package :: <https://github.com/xenodium/ready-player>
+ Dependencies :: =ffmpeg= =ffmpegthumbnailer= =mpv=

This should be installed via Nixpkgs due to external dependencies.

#+begin_src emacs-lisp
(use-feature! ready-player
  :mode
  ("\\.\\(aiff\\|flac\\|mp3\\|m4a\\|mp4\\|mkv\\|opus\\|wav\\|webm\\)\\'" . ready-player-major-mode)
  :config
  (setopt ready-player-autoplay nil
          ready-player-repeat nil
          ready-player-shuffle nil))
#+end_src
*** Yijing aka I Ching

Unfortunately, due to copyright restrictions, there are no modern translations
available for legal distribution.

**** DISABLED [[https://github.com/zzkt/i-ching][zzkt/i-ching]] (via MELPA)
:PROPERTIES:
:header-args: :tangle no
:ID:       42bd3676-6f96-499c-8d38-570833d5c365
:END:

Does not support changing line commentaries!

#+begin_src emacs-lisp
(package! i-ching
  (setopt i-ching-hexagram-size 18
          i-ching-hexagram-font "DejaVu Sans"
          i-ching-divination-method '3-coins
          i-ching-randomness-source 'pseudo)

  (keymap-set ceamx-insert-prefix "h" #'i-ching-insert-hexagram))
#+end_src

**** yijing.el
:PROPERTIES:
:ID:       c5573349-c13f-4702-8cf3-8f7cdb49add4
:END:

+ src :: https://www.emacswiki.org/emacs/i-ching.el

This package is generally more *interesting* than the simpler and
more-discoverable [[https://github.com/zzkt/i-ching][=i-ching= package on MELPA]].  It also, most
importantly, supports the display of commentaries on individual
changing lines.


#+begin_src emacs-lisp
(use-feature! yijing
  :commands (yijing/lookup
             yijing/cast))
#+end_src
*** Operate on buffers rectangularly with the ~rect~ feature
:PROPERTIES:
:ID:       8465808e-c79f-4e30-a88f-a9e64401ff95
:END:
:LOGBOOK:
- Refiled on [2025-01-27 Mon 09:34]
:END:

#+begin_src emacs-lisp
(use-feature! ceamx-tools
  :bind ( "C-x SPC" . #'ceamx/rectangle-dispatch/body))
#+end_src

*** Provide the ~ceamx-init-tools~ feature
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-tools.el :comments no
(provide 'ceamx-init-tools)
;;; ceamx-init-tools.el ends here
#+end_src

** “Fun” :fun:
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/ceamx-init-fun.el
:VISIBILITY: folded
:END:

*** Requirements
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-fun.el :comments no
;; -*- lexical-binding: t; -*-

(require 'ceamx-lib)
#+end_src

