config.org
*** Zone out in ~zone~
:PROPERTIES:
:ID:       0ffe546e-0213-4686-8dd2-2c0f20770c85
:END:

+ EmacsWiki :: <https://www.emacswiki.org/emacs/ZoneMode>

#+begin_src emacs-lisp
(use-feature! zone
  :defer 30
  :autoload (zone-when-idle)
  :defines (zone-timer)
  :init
  (def-hook! ceamx-zone-when-idle-h ()
    'ceamx-emacs-startup-hook
    "Zone out when idle.
Return the new `zone' timer."
    (zone-when-idle (* 60 10))))

;; FIXME: broken: wrong type argument arrayp (for pgm arg)
;;        (where did this even come from? emacswiki?)
;; (defun zone-choose (pgm)
;;   "Choose a PGM to run for `zone'."
;;   (interactive
;;     (list
;;       (completing-read
;;         "Program: "
;;         (mapcar 'symbol-name zone-programs))))
;;   (let ((zone-programs (list (intern pgm))))
;;     (zone)))
#+end_src

*** Provide the ~ceamx-init-fun~ feature
:PROPERTIES:
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp
(provide 'ceamx-init-fun)
;;; ceamx-init-fun.el ends here
#+end_src

* Flows
:PROPERTIES:
:ID:       2fe0f61e-e7f4-4d5a-9343-691d3782b19d
:header-args:emacs-lisp: :tangle lisp/ceamx-init-flows.el
:END:

** Requirements
:PROPERTIES:
:ID:       3056ce3e-7db7-4d73-86f6-a2cd55916cfc
:END:

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
#+end_src

** =elpaca-wait=
:PROPERTIES:
:ID:       962663f8-fe8f-4b78-88f6-a4817fdff001
:END:

#+begin_src emacs-lisp
(elpaca-wait)
#+end_src

** Thee Something-Doing Flows
:PROPERTIES:
:ID:       c6cbf999-36db-4d7f-b59d-63bb8da97215
:END:

*** Goals
:PROPERTIES:
:ID:       386d8261-6536-4938-a096-5cf3f215332b
:END:

Something-Doing is a body.

**** What are the composite flows of Something-Doing?
:PROPERTIES:
:ID:       0298d32f-2c00-47fc-9b8d-5e97cd5224a6
:END:

***** Chrismont: start workday with a statement of status and intent
:PROPERTIES:
:ID:       48166bdf-404a-49c4-8b30-76c7e68ef0f8
:END:

- What are you working on?
- Are you facing any impediments?
- Can anyone help out?

***** Cea: process inbox
:PROPERTIES:
:ID:       2df1da53-c491-4de6-98f5-abdb625c0ec6
:END:

- Set deadline, scheduled, tags before refile
- Target main todo file

***** Cea: weekly review
:PROPERTIES:
:ID:       c406ec7f-b589-49f2-8eb6-67a1af1dd29f
:END:

- Archive done tasks
- Set goals for week
  - What constitutes an achievable goal?
  - How many?

***** Cea: quick capture dialog
:PROPERTIES:
:ID:       75c83d17-0e6a-42dc-830b-ee1608a380f4
:END:

***** Cea: integrate with input from other devices
:PROPERTIES:
:ID:       16fdda1f-74b0-46d4-8fe7-d30b5da3c145
:END:

- Android: Orgzly Revived

***** Chrismont: meeting notes associated with calendar events
:PROPERTIES:
:ID:       b323f1fb-48e2-40c1-9c81-a3b0286eb8fc
:END:

+ Connect to Outlook calendar
+ Connect to Proton calendar

***** Cea: Bullet Journal flow
:PROPERTIES:
:ID:       b7f9cee6-eaea-4477-8d5b-f2be88a7dcac
:END:

This is a framework I know works alright for me.  It is lightweight
and encourages daily interaction and maintenance for the sake of awareness.

- types
  - todo items
  - events
  - notes
- requires daily refiling of incomplete tasks, scheduled events, scheduled tasks
- could be something like a daily inbox

***** Chrismont: record a work log to show thoughts
:PROPERTIES:
:ID:       44456f4a-4798-42c4-9bdc-fa32e1af55dc
:END:

- Resurface as external communications as needed
- Quick-as-possible capture into daily log
- Could leverage Denote journal functionality
- Clock-in/out with visible timer in modeline

***** Cea: record random thoughts as notes

***** Cea: write secret journal entries without fear

*****
:PROPERTIES:
:ID:       193b1aa9-0697-4b81-87fc-3ac9fc2f876b
:END:

**** Which flows connect to other flows?
:PROPERTIES:
:ID:       aaa47347-0aa9-42b3-8df0-41d3bc4a2676
:END:



*** Org-Capture templates
:PROPERTIES:
:ID:       d7334fe7-a7a2-423e-8e3b-fca7c45af07e
:BACKLINKS: [[id:c9f35626-6cec-46eb-a140-50be234d55da][Set up Org-Capture]]
:END:

#+begin_src emacs-lisp
(require 'org-capture)
(require 'doct)

(setopt doct-default-entry-type 'entry)
(setopt doct-warnings t)

(setopt org-capture-templates
        (doct
         '(("Inbox item" :keys "c"
            :file ceamx-default-todo-file
            :headline "Inbox"
            :template ("* TODO %?"
                       "%i %a")
            :icon ("checklist" :set "octicon" :color "green"))

           ("Note" :keys "n"
            :file denote-last-path
            :type plain
            :template denote-org-capture
            :no-save t
            :immediate-finish nil
            :kill-buffer t
            :jump-to-captured t)

           ("Journal entry" :keys "j"
            :file denote-journal-extras-path-to-new-or-existing-entry
            :template ("* %U %?"
                       "%i %a")
            :kill-buffer t
            :empty-lines 1)

           ;; ("Emacs" :keys "e"
           ;;  :file ceamx-literate-config-file
           ;;  :template "* TODO "
           ;;  )
           )))
#+end_src

*** Org-Agenda groups
:PROPERTIES:
:ID:       815ead58-41ac-406b-b1fe-4d6c4c838617
:BACKLINKS: [[id:6438e6e9-5052-403d-8c23-a1ee8daf0ec2][=org-super-agenda= :: enchanted groupings for Org-Agenda]]
:END:

Define agenda groups for display with the =org-super-agenda= extension:

#+begin_src emacs-lisp
(after! org-super-agenda
  ;; XXX: `setq' to avoid type error with `setopt'
  (setq org-super-agenda-groups
        '((:name "Today"
                 :time-grid t
                 :todo "TODAY")

          (:name "Important"
                 :tag "financial"
                 :priority "A")

          (:order-multi
           (2 (:name "Personal"
                     :habit t
                     :tag ("personal" "home"))
              (:name "Shopping"
                     :tag "shopping"
                     :tag "buy")))

          (:todo "WAITING" :order 8)
          (:todo ("SOMEDAY" "TO-READ" "TO-LISTEN" "TO-WATCH")
                 :order 9)
          (:priority<= "B" :order 1))))
#+end_src

** Provide the =ceamx-init-flows= feature
:PROPERTIES:
:ID:       4fb152c5-078d-4851-b518-55f85bbd6d22
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp :tangle lisp/ceamx-init-flows.el :comments no
(provide 'ceamx-init-flows)
;;; ceamx-init-flows.el ends here
#+end_src

* Load Features
:PROPERTIES:
:header-args: :tangle init.el
:VISIBILITY: folded
:ID:       4e93b7dc-8c0c-44b5-903b-f86ea342fd61
:END:

#+begin_src emacs-lisp
(require 'ceamx-init-ui)
(require 'ceamx-init-modeline)
(require 'ceamx-init-essentials)
(require 'ceamx-init-completion)
(require 'ceamx-init-search)
(require 'ceamx-init-dired)
(require 'ceamx-init-window)
(require 'ceamx-init-vcs)
(require 'ceamx-init-langs)
(require 'ceamx-init-notes)
(require 'ceamx-init-org)
(require 'ceamx-init-tools)
(require 'ceamx-init-news)
(require 'ceamx-init-eww)
(require 'ceamx-init-printing)
(require 'ceamx-init-fun)
(require 'ceamx-init-flows)
#+end_src

* Command Bindings
:PROPERTIES:
:header-args: :tangle init.el
:VISIBILITY: folded
:ID:       d39ff068-1ed1-4bc6-bc7e-f5aa50bb8edd
:END:

** [C-c o] :: Launch
:PROPERTIES:
:ID:       bb8d84ed-5854-4892-9b76-77e67063a71e
:END:

#+begin_src emacs-lisp
(define-keymap :keymap ceamx-launch-prefix
  "s" #'scratch-buffer)
#+end_src

** [C-c q] :: Session
:PROPERTIES:
:ID:       89f0be09-aa04-40cd-9365-f41a5fbf37c6
:END:

#+begin_src emacs-lisp
(define-keymap :keymap ceamx-session-prefix
  "a c" #'cursory-set-preset
  "a d" #'ceamx-ui/dark
  "a f" #'fontaine-set-preset
  "a l" #'ceamx-ui/light
  "a o" #'olivetti-mode

  "p f" #'elpaca-fetch-all
  "p m" #'elpaca-merge-all
  "p t" #'elpaca-try

  "q" #'save-buffers-kill-emacs
  "Q" #'kill-emacs
  "r" #'restart-emacs)

;; (use-feature! ceamx-ui
;;   :commands (ceamx-ui/dark ceamx-ui/light)
;;   :config
;;   (define-keymap :keymap ceamx-session-prefix
;;     "a d" #'ceamx-ui/dark
;;     "a l" #'ceamx-ui/light))
#+end_src

** [C-c t] :: Toggle

#+begin_src emacs-lisp
(define-keymap :keymap ceamx-toggle-prefix
  "f" #'flycheck-mode
  "k" #'keycast-mode-line-mode
  "l" #'display-line-numbers-mode
  "M" #'menu-bar-mode
  "o" #'outline-minor-mode
  "T" #'tab-bar-mode
  "w" #'window-toggle-side-windows
  "W" #'toggle-window-dedicated
  "z" #'logos-focus-mode)
#+end_src

** Window
:PROPERTIES:
:ID:       93d96a59-5e99-4939-8691-14aaaf942adb
:END:

#+begin_src emacs-lisp
(define-keymap :keymap ceamx-window-prefix
  "w" #'ceamx/window-dispatch)

(define-keymap :keymap window-prefix-map
  "w" #'ace-window

  "d" #'ace-delete-window
  "p" #'popper-toggle
  "P" #'popper-toggle-type
  "u" #'winner-undo
  "U" #'winner-redo

  "h" #'windmove-left
  "H" #'ceamx/window-move-left
  "j" #'windmove-down
  "J" #'ceamx/window-move-down
  "k" #'windmove-up
  "K" #'ceamx/window-move-up
  "l" #'windmove-right
  "L" #'ceamx/window-move-right

  "=" #'balance-windows
  "<" #'flip-frame
  ">" #'flop-frame
  "[" #'rotate-frame-clockwise
  "]" #'rotate-frame-anticlockwise
  "{" #'rotate-frame
  "}" #'rotate-frame)

(define-keymap :keymap resize-window-repeat-map
  "<up>" #'enlarge-window
  "<down>" #'shrink-window
  "<left>" #'shrink-window-horizontally
  "<right>" #'enlarge-window-horizontally)

(defvar-keymap ceamx-window-transposition-repeat-map
  :repeat t

  "SPC" #'transpose-frame
  "<" #'flip-frame
  ">" #'flop-frame
  "[" #'rotate-frame-clockwise
  "]" #'rotate-frame-anticlockwise)

(defvar-keymap ceamx-window-lifecycle-repeat-map
  :repeat t

  "2" #'split-window-below
  "3" #'split-window-right
  "o" #'ace-window)
#+end_src

* Finalize
:PROPERTIES:
:header-args: :tangle init.el
:VISIBILITY: folded
:END:

** Start the Emacs server process if not already running

#+begin_src emacs-lisp
(def-hook! ceamx-init-maybe-start-server-h ()
  'ceamx-emacs-startup-hook
  "Allow this Emacs process to act as server if a server is not already running."
  (require 'server)
  (unless (server-running-p)
    (server-start)))
#+end_src

** macOS: Restart Yabai after init

Otherwise, =yabai= will not "see" the Emacs GUI window.

#+begin_src emacs-lisp
(when (and (ceamx-host-macos-p) (display-graphic-p))
  (def-hook! ceamx-after-init-restart-yabai-h ()
    'ceamx-after-init-hook
    "Restart the yabai service after init."
    (after! exec-path-from-shell
      (async-shell-command "yabai --restart-service"))))
#+end_src

** Optionally load the ~custom-file~

#+begin_src emacs-lisp
(when ceamx-load-custom-file
  (load custom-file t))
#+end_src
* Maintenance
:PROPERTIES:
:VISIBILITY: folded
:ID:       2511f122-e694-4055-8177-e77b87952e7c
:END:

** Functions to clean and re-tangle Elisp files

#+begin_src emacs-lisp :noweb yes :results silent
<<ceamx-tangle-src>>
(ceamx/tangle-fresh)
#+end_src

#+name: ceamx-tangle-src
#+begin_src emacs-lisp
(require 'f)
(require 'llama)

(require 'ob-tangle)

(defun ceamx-list-tangled-init-files ()
  "List all tangled files in `user-emacs-directory'.
Note that this is a crude approximation reflective of our
expectations but not necessarily files that were truly tangled.

The assumptions are as follows:

-- All Emacs Lisp files within the \"lisp\" subdirectory
-- early-init.el
-- init.el

If there are any Emacs Lisp files within the \"lisp\"
subdirectory that have not been created as a result of tangling,
they will also be included in the result."
  (let ((dir user-emacs-directory))
    (append
     (mapcar (##f-join dir %) '("early-init.el" "init.el"))
     (f-files (f-join dir "lisp") (##f-ext-p % "el") t))))

(defun ceamx/purge-tangled-init-files ()
  "Delete all tangled init files according to `ceamx-list-tangled-init-files'."
  (interactive)
  (dolist (file (ceamx-list-tangled-init-files))
    (f-delete file)))

(defconst ceamx-literate-config-file (locate-user-emacs-file "config.org"))

(defun ceamx/tangle-fresh (&optional src-file)
  "Purge all existing tangled init files and re-tangle.
When SRC-FILE is non-nil, it will be used as the source file to
be tangled by `org-babel-tangle-file'.  Otherwise, if SRC-FILE is
nil, the value of `ceamx-literate-config-file' will be the
default source file."
  (interactive)
  (ceamx/purge-tangled-init-files)
  (org-babel-tangle-file
   (or src-file ceamx-literate-config-file)))
#+end_src


** Debugging

- Source :: [[https://github.com/progfolio/.emacs.d/blob/master/init.org?plain=1][.emacs.d/init.org at master · progfolio/.emacs.d]]
- Retrieved :: [2024-06-04 Tue 22:20]

Running this form will launch the debugger after loading a package.

This is useful for finding out when a dependency is requiring a package (perhaps
earlier than you want).

Use by tangling this block and launching Emacs with =emacs --debug-init=.

#+begin_src emacs-lisp :var file="" :results silent :tangle no
(unless (string-empty-p file)
  (eval-after-load file
    '(debug)))
#+end_src

Similarly, this variable will hit the debugger when a message matches its
regexp.

#+begin_src emacs-lisp :tangle no
(setq debug-on-message "")
#+end_src

Adding a variable watcher can be a useful way to track down initialization and
mutation of a variable.

#+begin_src emacs-lisp :tangle no
(add-variable-watcher 'org-capture-after-finalize-hook
                      (lambda (symbol newval operation where)
                        (debug)
                        (message "%s set to %s" symbol newval)))
#+end_src

#+begin_src emacs-lisp :tangle no
(setq debug-on-error t)
#+end_src

* Resources
:PROPERTIES:
:ID:       a097628e-0198-47b4-afbe-0b8cfc9ba6d7
:END:

- [[info:elisp#Tips][(elisp) Tips]]
- [[info:elisp#Minor Mode Conventions][(elisp) Minor Mode Conventions]]


** [[https://github.com/james-stoup/emacs-org-mode-tutorial][GitHub - james-stoup/emacs-org-mode-tutorial: A primer for users trying to make sense of Org Mode]]
:PROPERTIES:
:ID:       912620fa-b1ea-4a80-9958-3814ffbde545
:END:
* Styleguide
:PROPERTIES:
:VISIBILITY: folded
:ID:       53c7af29-f9bc-4e07-be6c-ccf2db415170
:END:

** Boolean Variables vs. Predicate Functions
:PROPERTIES:
:CUSTOM_ID: boolean-variables-vs.-predicate-functions
:END:
The naming for booleans and predicates is different.

*** Example
:PROPERTIES:
:CUSTOM_ID: example
:END:
#+begin_src elisp
(defvar ceamx-foo-flag t)
(defvar ceamx-is-foo-enabled t)
(defun ceamx-foo-p ()
  ;; sketchy logic (don't do this)
  (or ceamx-foo-flag ceamx-is-foo-enabled))
#+end_src

*** Explanation
:PROPERTIES:
:CUSTOM_ID: explanation
:END:
From
[[https://www.gnu.org/software/emacs/manual/html_node/elisp/Coding-Conventions.html][Coding
Conventions (GNU Emacs Lisp Reference Manual)]]:

#+begin_quote
If the purpose of a function is to tell you whether a certain condition
is true or false, give the function a name that ends in 'p' (which
stands for "predicate".  If the name is one word, add just 'p'; if the
name is multiple words, add '-p'.  Examples are =framep= and
=frame-live-p=.  We recommend to avoid using this =-p= suffix in boolean
variable names, unless the variable is bound to a predicate function;
instead, use a =-flag= suffix or names like =is-foo=.

#+end_quote

*** Org-Mode: When to wrap inline text in ~tildes~ vs. =equals=

[[info:(org) Emphasis and Monospace][info (org) Emphasis and Monospace]]

[[https://emacs.stackexchange.com/a/21870][What's the relationship between ~foo~ and =foo= in org-mode? - Emacs Stack Exchange]]

